{"Human Rights": ["Following up on 'Bowling for Columbine', film-maker Michael Moore provides deep and though-provoking insights on the American security system, the level of paranoia, fear, uncertainty, false values and patriotism, which all combined together to set a stage for George W. Bush to launch a war on Iraq instead of focusing on getting the real culprit(s) behind the terrorist attacks of September 11, 2001. This documentary also focuses on how some Saudis were safely and secretly flown out of America while planes were ostensibly grounded after the attacks. Archived film footage, candid interviews with politicians, and an overall waste of public funds for a war that was initiated on false pretension to wit: a weapon of mass distraction - to take the focus away from the real enemy and get Americans glued to their TV sets to watch innocent Iraqis and Afghans getting killed. And a war that would eventually alienate the U.S.A. and it's citizens from almost every country on Earth. Written by rAjOo (gunwanti@hotmail.com)", "Documentary look at health care in the United States as provided by profit-oriented health maintenance organizations (HMOs) compared to free, universal care in Canada, the U.K., and France. Moore contrasts U.S. media reports on Canadian care with the experiences of Canadians in hospitals and clinics there. He interviews patients and doctors in the U.K. about cost, quality, and salaries. He examines why Nixon promoted HMOs in 1971, and why the Clintons' reform effort failed in the 1990s. He talks to U.S. ex-pats in Paris about French services, and he takes three 9/11 clean-up volunteers, who developed respiratory problems, to Cuba for care. He asks of Americans, \"Who are we?\" Written by <jhailey@hotmail.com>", "A couple embarks on a journey home for Chinese new year along with 130 million other migrant workers, to reunite with their children and struggle for a future. Their unseen story plays out as China soars towards being a world superpower.", "Using the torture and death in 2002 of an innocent Afghan taxi driver as the touchstone, this film examines changes after 9/11 in U.S. policy toward suspects in the war on terror. Soldiers, their attorneys, one released detainee, U.S. Attorney John Yoo, news footage and photos tell a story of abuse at Bagram Air Base, Abu Ghraib, and Guantanamo Bay. From Bush, Cheney, Rumsfeld, and Gonzalez came unwritten orders to use any means necessary. The CIA and soldiers with little training used sleep deprivation, sexual assault, stress positions, waterboarding, dogs and other terror tactics to seek information from detainees. Many speakers lament the loss of American ideals in pursuit of security. Written by <jhailey@hotmail.com>", "Documentary filmmaker Frederick Wiseman takes us inside the Massachusetts Correctional Institution Bridgewater where people stay trapped in their madness.", "In this cable show, muckraking director Michael Moore continues his war against all the wrongs committed by greedy businesses, the callous wealthy and opportunistic politicians that exploit the little person in society. To that end, we have his standard protest pranks, investigative reports and satiric games with the audience. Written by Kenneth Chisholm <kchishol@execulink.com>", "Five Jewish Hungarians, now U.S. citizens, tell their stories: before March, 1944, when Nazis began to exterminate Hungarian Jews, months in concentration camps, and visiting childhood homes more than 50 years later. An historian, a Sonderkommando, a doctor who experimented on Auschwitz prisoners, and US soldiers who were part of the liberation in April, 1945, also comment. Most telling are details: Renée packing her bathing suit, Irene swallowing the diamonds her mother gave her to buy bread, Alice's memorial for her sister Klara, Bill escaping police by jumping into a line of Jews going to Buchenwald, and Tom told by a US soldier to have \"all the damn bananas and oranges you can eat.\" Written by <jhailey@hotmail.com>", "", "This bold documentary follows a young Tibetan refugee in Quebec as she returns to her native land carrying a video message by the Dalai Lama. Tibetan families gather around, transfixed by the images of the leader who since 1950 has been trying to obtain permission from the Chinese authorities to return to his homeland and his people. Written by Anonymous", "What would happen if a country of 97 million people were taught at a young age that the boogie man was real. In the Philippines for the last 400 years, the 'aswang' has been used as propoganda and social control by Spanish Colonizers, the Catholic Church, the Philippine Administration, and even the CIA. Written by Anonymous", "In Uganda, a new bill threatens to make homosexuality punishable by death. David Kato - Uganda's first openly gay man - and his fellow activists work against the clock to defeat the legislation while combating vicious persecution in their daily lives. But no one, not even the filmmakers, is prepared for the brutal murder that shakes the movement to its core and sends shock waves around the world. Written by Anonymous", "As a tropical storm beats down on the island of Cebu, two sisters leave work and never make it home... Simultaneously a murder-mystery and an exposé of endemic corruption in the Philippines today, GIVE UP TOMORROW looks intimately at the case of Paco Larrañaga, a student accused of killing two sisters in July 1997. In a way that is both specific to the country and disquietingly universal, the film exposes a Kafkaesque extravaganza populated by flamboyantly crooked public officials, cops on the take, and a frenzied legal and media circus. GIVE UP TOMORROW is also an intimate family drama focused on the near mythic struggle of two angry, sorrowful mothers who have dedicated more than a decade to executing or saving one young man. Written by Thoughtful Robot Productions", "After 42 years, feisty and delightful lesbian couple Edie and Thea are finally getting married. From the early '60s to the present day, the tireless community activists persevere through many battles, both personal and political. As Edie says, We just went on with this talent we have for wrestling joy from the shit. Susan Muska and Greta Olafsdottir (THE BRANDON TEENA STORY) return with a love story of two remarkable women whose commitment to each other is an inspiration to us all. Written by Anonymous", "How a government wilfully withheld vital evidence from a court of law, deceived its public, orchestrated an unprecedented media campaign, and ruthlessly deployed its organs of state against one of its own citizens. Expendable presents, and demonstrates, the crushing, pre-meditated, and often brutal acts which a western government is prepared to inflict upon a helpless woman, Schapelle Corby, in pursuit of political expediency. Written by Anonymous", "Part contemporary investigation and part historical inquiry, documentary follows the quest of one journalist in search of justice. The film focuses on Christopher Hitchens' charges against Henry Kissinger as a war criminal - allegations documented in Hitchens' book of the same title - based on his role in countries such as Cambodia, Chile, and Indonesia. Kissinger's story raises profound questions about American foreign policy and highlights a new era of human rights. Increasing evidence about one man's role in a long history of human rights abuses leads to a critical examination of American diplomacy through the lens of international standards of justice. Written by Sujit R. Varma", "Using smuggled footage, this documentary tells the story of the 2007 protests in Burma by thousands of monks.", "\"We've worked so hard on this land,\" says Sav Samourn. \"And now they've come to destroy it all. Sooner or later it will all be gone.\" In her directorial debut, award-winning filmmaker Kalyanee Mam travels to her native homeland to capture the stories of three young Cambodians struggling to maintain their traditional way of life while the modern world closes in around them. Deep in the jungle, Sav Samourn struggles as large companies encroach and \"progress\" claims the life-giving forests. She discovers there's little room for wild animals, ghosts - and the home she has always known. In a fishing hamlet, Sari Math must quit school to help support his family. But as the fish catch dwindles, Sari and his family find their livelihood threatened. In a village, Khieu Mok must leave to seek work in a Phnom Penh factory to help pay her family's debts. But city life proves no better, and Khieu struggles between her need to send money home and her duty to be with her loved ones. From Cambodia's ... Written by Kalyanee Mam", "The Last Survivor presents the stories of genocide survivors and their struggle to make sense of tragedy. They work to educate, motivate and promulgate a civic response to mass atrocity crimes, with a focus on awareness, prevention and promoting social activism and civic engagement. Written by Anonymous", "Naomi Klein gives a lecture tracing the confluence of ideas about modifying behavior using shock therapy and other sensory deprivation and modifying national economics using the \"shock treatment\" of Milton Friedman and the Chicago School. She moves chronologically: Pinochet's Chile, Argentina and its junta, Yeltsin's Russia, Bush and Bremer's Iraq. A trumped-up villain provides distraction or rationalization: Marxism, the Falklands, nuclear weapons, terrorists; and, always, there is a great shift of money and power from the many to the few. News footage, a narrator, and talking heads back up Klein's analysis. She concludes on a note of hope. Written by <jhailey@hotmail.com>", "This is the story of more than four hundred Americans who participated in a bold and dangerous experiment designed to awaken the conscience of a complacent nation. These self-proclaimed, 'Freedom Riders' challenged the mores of a racially segregated society by performing a disarmingly simple act. Written by Anonymous", "Two Danish comedians join the director on a trip to North Korea, where they have been allowed access under the pretext of wanting to perform a vaudeville act.", "", "Edmund Purdom narrates a pseudo-documentary about sexuality in Sweden. It shows contraceptives for teen girls, lesbian nightclubs, wife swapping, porno movies, biker gangs, and Walpurgis Night celebrations. It also examines Sweden's purported drug, drinking and suicide problems. It features the original appearance of the Piero Umiliani's nonsense song \"Mah Nà Mah Nà\" which was later popularized by \"Sesame Street\" and \"The Muppet Show\". Written by Anonymous", "Peter Karena, his wife Colleen, their six children and many horses live almost wild in the stunning beauty of New Zealand's rugged Ruahine Mountains. Until, that is, Peter's escalating battle with his own father has profound consequences for the whole clan. Written by Palm Springs International Film Festival", "2012: Time For Change is a documentary feature that presents ways to transform our unsustainable society into a regenerative planetary culture. This can be achieved through a personal and global change of consciousness and the systemic implementation of ecological design. Written by Anonymous", "Shot clandestinely over a two year period, this film provides a rare look into the second most isolated country on the planet held in a stasis by a brutal military regime for almost a half century. From over 100 interviews of people across Burma, including the recently released Aung San Suu Kyi, interwoven with stunning footage of Burmese life this documentary is truly unique. Written by Anonymous", "On the eve of the 40th anniversary of the Gay Rights Movement, the film explores the drama, struggle and enduring legacy of the first-ever gay play and subsequent Hollywood movie to successfully reach a mainstream audience. Beloved by some for breaking new ground, and condemned by others for reinforcing gay stereotypes, The Boys in the Band sparked heated controversy that still exists four decades later. Written by Miguel Camnitzer", "Summer show that poked fun at TV's news magazine shows like \"60 Minutes.\" Some of the interviews consisted of happy dogs on Prozac, following an Avon Lady through the Amazon, etc. Written by J.E. McKillop <jack-mckillop@worldnet.att.net>", "", "Troublemaking duo Andy Bichlbaum and Mike Bonanno, posing as their industrious alter-egos, expose the people profiting from Hurricane Katrina, the faces behind the environmental disaster in Bhopal, and other shocking events.", "A young Kenyan's life changes drastically when his education is sponsored by a Swedish stranger. Years later, he founds his own scholarship program to replicate the kindness he once received.", "A devoted son of Holocaust survivors and ardent critic of Israeli foreign policy, the polarizing American political scientist and author Norman Finkelstein has been called a lunatic and self-hating Jew by some, and an inspirational revolutionary by others. Exploring the deeply complex issues at the heart of the Palestinian-Israeli conflict, American Radical is the insightful and enraging documentary that follows Finkelstein around the world as he attempts to negotiate a voice among impassioned critics and supporters. Uncompromising even in the face of his recent denial of tenure at DePaul University, Finkelstein is a complex and supremely lonely figure whose self-destructive nature often undermines his academic credibility. A guaranteed argument starter, this potent documentary plunges viewers into the psychological and intellectual underpinnings of a vitriolic personality. Written by Anonymous", "The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America.", "In 2008 Mike Campbell - one of the few remaining white farmers in Zimbabwe to have held fast in the face of the violent 'Land Reform' programme - took the unprecedented step of challenging President Robert Mugabe before the SADC International Court (SADC - South African Development Community) to defend his farm, which is also home to 500 black workers and their families, and to charge Mugabe and his government with racial discrimination and with violations of Human Rights. Written by Anonymous", "A profile of Haitian radio journalist and human rights activist, Jean Dominique. It includes: historical footage of Haiti's vivid and tumultuous past; interviews with Dominique, himself and with Michele Montas--his heroic wife, life-long love, and extraordinary partner; and incorporates footage shot before Dominique's assassination on April 3, 2000. Written by Sujit R. Varma", "The world's oldest Kink/Fetish contest - International Mr. Leather - isn't just for 'white, gay males' anymore. Now, straights, the disabled and transgender men come together to compete for this honor of masculinity. And it was all started 30 years earlier by a man who took the risk of opening Chicago's first Leather bar in the 1950's. This sexy, smart, surprisingly upbeat doc dares to ask: Is there a bit of Kink Crusader in us all? Written by Anonymous", "With its riveting footage of a secretive \"underground railroad,\" SEOUL TRAIN is the gripping documentary exposé into the life and death of North Koreans as they try to escape their homeland and China. SEOUL TRAIN also delves into the complex geopolitics behind this growing and potentially explosive humanitarian crisis. By combining vérité footage, personal stories and interviews with experts and government officials, SEOUL TRAIN depicts the flouting of international laws by major countries, the inaction and bureaucracy of the United Nations, and the heroics of activists that put themselves in harm's way to save the refugees. Written by Anonymous", "Mikhail Vartanov's influential documentary about the imprisoned genius Sergei Parajanov who was persecuted \"during the height of his artistic power,\" for his unruly life style and non-conformist masterpieces -- \"The Color of Pomegranates\" and \"Shadows of Forgotten Ancestors\" -- hailed as some of the greatest motion pictures of the 20th century. Made in a blockaded, war-torn Armenia, under the prohibitive conditions of only one hour daily limit of electricity, Parajanov: The Last Spring (1992) caused a sensation at its premieres in Russia and Armenia and influenced numerous future books, writings, and films. After the premiere in Russia, Tonino Guerra, the screenwriter of Federico Fellini and Michelangelo Antonioni, wrote: Mikhail Vartanov's film, Parajanov: The Last Spring (1992), about the last days of our great Parajanov, excited and filled me with the strength to resume the way of the magnificent tale that the Maestro had taken. In Parajanov: The Last Spring (1992), Mikhail Vartanov... Written by PARAJANOV.com", "Unmanned: America's Drone War, the eighth full-length feature documentary from director Robert Greenwald and his Brave New Foundation organization, investigates the impact that U.S. drone strikes have across the globe. The film reveals the realities of drone warfare-the violation of international law, the loss of life, the far-reaching implications for the communities that live under drones, and blowback the United States faces. Unmanned details the death of Tariq Aziz, a 16 year-old Pakistani boy, who like most teenagers, loved soccer and his computer. He was killed in a drone strike three days after attending a public meeting in Islamabad calling for the end of drone strikes in Pakistan. Unmanned also investigates the Obama administration's use of signature strikes that targets people based on 'pattern of life' characteristics. One such example took place in 2011 in Datta Khel, a tribal region in northern Pakistan, killing approximately 41 people and injuring scores more. In another... Written by Anonymous", "Kenneth Young committed armed robbery at 14. He's guilty. He's now facing life in prison. The United States is the only country in the world that sentences children to life without parole. For over a decade, Kenneth believed he would die behind bars, until in 2010 the U.S. Supreme Court ruled life sentences for children who haven't killed illegal. Of the more than 2,500 children sentenced to life, many are now eligible for release. Kenneth Young is living proof of a child's remarkable capacity for change. In a country that favors retribution over rehabilitation, we witness this young man's struggle for a second chance. 15 TO LIFE is a story of redemption that begs the question, how should we treat children in the justice system? Written by Anonymous", "Fish out of Water tackles the seven Bible verses used to condemn homosexuality and justify marriage discrimination. This feature documentary uses humor and original animation to make a traditionally complex and controversial topic accessible to those who don't like talking about religion and sexuality. Fish out of Water dives into the underbelly of America, crisscrosses red and blue states and talks to ministers from every denomination to uncover America's impassioned relationship with homosexuality and the Bible. With slapstick animation and quirky interviews taken everywhere from barbershops to mega churches, Fish out of Water delivers a voice to the oppressed and informs to the misled. Most importantly, Fish out of Water sits down with hundreds of gay, lesbian, bisexual and transgender folks to impart their experiences with faith and sexuality. This unique lens spans across culture, race, religion, age, socio-economic level and puts a relatable face on the themes of Fish out of ... Written by Ky Dickens", "'Children of the Pyre' is a compelling real-life, self-narrative of seven extraordinary children who make their living out of the dead. They collect, snatch or steal used coffin shrouds and sell them for petty amounts in order to ensure their own and their family's survival Tempered by the heat of the pyre, strengthened in the face of adversities and crafted by a volley of abuses, these imps weave through the pyres and struggle through disdain in this land of the dead. Laughing, smiling, weeping, fighting and shouting, these children run the race for survival - winning it again and again - everyday. The film is a terrible saga of exploitation that celebrates the victory of innocence over the most harrowing realities of life. It's a torturous journey through seared bodies, callous minds and dead consciences that constitute the human reality of the ghats at Varanasi Written by Anonymous", "Kosovo: Can You Imagine? is about the Serbs that live in Kosovo and the lack of human rights that they have today, in the 21st century. Most of the Kosovo Serbs have been ethnically cleansed by the Albanians who make up the majority of Kosovo. Kosovo has been under UN administration since 1999 when NATO bombed Serbia for 76 days to halt a crackdown on ethnic Albanian separatism in its province of Kosovo. In the years following the war, thousands of Serbs were expelled from their homes, kidnapped and killed. Their houses, cultural and religious sites were burned and destroyed. Kosovo for the Serbs is what Jerusalem is for the Jewish people. It is the cradle of their statehood, culture and religion. Most of the important Serbian Christian Orthodox monasteries are in Kosovo. Today, Serbs still have a deep spiritual and traditional connection to Kosovo, a land which is being cleansed of everything Serbian. Most of the Kosovo Serbs are internally displaced, some of them live in small ... Written by Boris Malagurski", "A documentary about EuroPride festival that took place in Sweden 2008.", "Filmed during nine journeys throughout Tibet, India and Nepal, this film brings audiences to the long-forbidden \"rooftop of the world\"... from rarely-seen rituals in remote monasteries, to horse races with Khamba warriors; from brothels and slums in the holy city of Lhasa, to magnificent Himalayan peaks still traveled by nomadic yak caravans. The dark secrets of Tibet's recent past are chronicled through personal stories and interviews, and a collection of undercover and archival images. TIBET: CRY OF THE SNOW LION is an epic story of courage and compassion. Written by Sue Peosay", "Before the 30th anniversary, Vancouver's Gay Pride Parade director examines relevance of Pride celebrations internationally. He travels to places where Pride is steeped in protest to experience the powerful oppression that still exists. Pride is more than a parade, it's a giant step on the road to equality. Written by Anonymous", "A gray winter sky hangs over lonely city streets, rotted oil derricks, and abandoned factories. This is Oil City, Pennsylvania, a fading industrial town in the heart of the American rust belt. It is the sort of town that Barrack Obama had in mind when he made his infamous comments about bitter small town residents clinging to their guns and religion as they watch the rest of the world pass them by. The peace and quiet is shattered when the filmmaker, Oil City native Joe Wilson, places the announcement of his wedding to another man in the local paper. The announcement catches the eye of Kathy Springer, a local woman whose teenage son, CJ, is being brutally tormented at school because he is gay. Ignored by the school authorities and with no where else to turn, she seeks help from Wilson and they begin a difficult but ultimately successful struggle to take on the school authorities who made every day \"eight hours of pure hell\" for CJ. The announcement has a very different effect on Diane... Written by Dean Hamer", "Happiness, I want more! From the alleys of Nigeria and the beaches of California to the mountains of India, ordinary young people lead us on an extraordinary journey to explore the nature of lasting happiness and end up starting a movement. Written by Anonymous", "Paul Pearson, a lifelong Santa Monica resident, has been building electric cars for his own use and for friends in Santa Monica. He was recently visited by a DMV sting operation, in which he agreed to help two gentlemen convert a Ford Thunderbird to full electric power. Consequently he has faced several trumped up charges and swatted them all off like flies. The prosecutor (Santa Monica assistant City Attorney Gary Rhoades) continues to try to convict Paul of something (to justify the waste of public funds? - Or, to avoid a Malicious Prosecution suit?), the defense has proven that Paul was not guilty of breaking any laws. After trying and failing to convict Paul of Illegal Manufacturing, re-manufacturing, illegal advertising, etc, the City Attorney is now calling Paul a 'media whore'. The irony is that Paul is actually building electric vehicles for another department of the City of Santa Monica. Written by Anonymous", "In July 2002, 22 Palestinian and Israeli teenage girls came to the U.S. to participate in a women's leadership program called Building Bridges for Peace. \"My So Called Enemy\" is a coming of age story about 6 of the program participants and how they reconcile their transformative experience in the program with the realities of life back home in the Middle East over the next 7 years. What unfolds is an emotionally-charged film about the human consequences of all conflicts--as seen through the eyes of 6 young women who are thoughtful, intelligent and articulate beyond their years. Written by Lisa Gossels"], "Prison Reform": ["In 2001, Andrew Bagby, a medical resident, is murdered not long after breaking up with his girlfriend. Soon after, when she announces she's pregnant, one of Andrew's many close friends, Kurt Kuenne, begins this film, a gift to the child. Friends, relatives, and colleagues say warm and loving things about Andrew, home movies confirm his exuberance. Andrew's parents, Kathleen and David, move to Newfoundland, Canada where the ex-girlfriend has gone. They await an arrest and trial of the murderer. They negotiate with the ex-girlfriend to visit their grandchild, Zachary, and they seek custody. Is there any justice; is Zachery a sweet and innocent consolation for the loss of their son? Written by <jhailey@hotmail.com>", "This one-hour weekly docu-soap from the creator/executive producer of \"American Chopper\" follows a group of real-life paranormal researchers as they investigate haunted houses throughout the country, encountering every type of imaginable haunting. Jason Hawes and Grant Wilson, plumbers by trade, head up TAPS -- The Atlantic Paranormal Society -- a group of ordinary, everyday people with an interest in getting to the bottom of your otherworldly disturbances. Written by -- SCI FI Channel, submitted by Senior Editor, SCIFI.COM", "Conversations with death row inmate Michael Perry and those affected by his crime serve as an examination of why people - and the state - kill.", "In the 1980s, ruthless Colombian cocaine barons invaded Miami with a brand of violence unseen in this country since Prohibition-era Chicago - and it put the city on the map. \"Cocaine Cowboys\" is the true story of how Miami became the drug, murder and cash capital of the United States, told by the people who made it all happen. Written by rakontur", "In 2001, four Pakistani Britons, Ruhal Ahmed, Asif Iqbal and Shafiq Rasul and another friend, Monir, travel to Pakistan for a wedding and in a urge of idealism, decide to see the situation of war torn Afganistan which is being bombed by the American forces in retaliation for the 9/11 terrorist attacks. Once there, with the loss of Monir in the wartime chaos, they are captured by Northern Alliance fighters. They are then handed them over the American forces who transport them to the prison camps at the Guantanamo Bay base in Cuba. What follows is three years of relentless imprisonment, interrogations and torture to make them submit to blatantly wrong confessions to being terrorists. In the midst of this abuse, the three struggle to keep their spirits up in that face of this grave injustice. Written by Kenneth Chisholm (kchishol@rogers.com)", "In the late 1980's, the Friedmans - father and respected computer and music teacher Arnold Friedman, mother and housewife Elaine Friedman, and their three grown sons, David Friedman, Seth Friedman and Jesse Friedman - of Great Neck, Long Island, are seemingly your typical middle class American family. They all admit that the marriage was by no means close to being harmonious - Arnold and Elaine eventually got divorced - but the sons talk of their father, while also not being always there for them, as being a good man. This façade of respectability masks the fact that Arnold was buying and distributing child pornography. Following a sting operation to confirm this fact, the authorities began to investigate Arnold for sexual abuse of the minor-aged male students of his computer classes, which he held in the basement of the family home. Based on interviews with the students, not only was Arnold charged with and ultimately convicted of multiple counts of sodomy and sexual abuse of these ... Written by Huggo", "In 1989, five black and Latino teenagers from Harlem were arrested and later convicted of raping a white woman in New York City's Central Park. They spent between 6 and 13 years in prison before a serial rapist confessed that he alone had committed the crime, leading to their convictions being overturned. Set against a backdrop of a decaying city beset by violence and racial tension, THE CENTRAL PARK FIVE tells the story of that horrific crime, the rush to judgment by the police, a media clamoring for sensational stories and an outraged public, and the five lives upended by this miscarriage of justice. Written by CP5", "In 1993, a horrific triple child murder was discovered in West Memphis, Arkansas, but the reaction to it precipitated a horror of its own. This film follows up on the story of the three boys, called the West Memphis Three, who were convicted for this crime with questionable evidence. For years, the boys' fate sparked a mass movement striving to prove their innocence while the state is equally determined to avoid admitting it could have been wrong. Through the swirl of new evidence and suspects, the Three tell their own tale about enduring this injustice against the opinions of the victim's families in a debate that eventually came to an inadequate resolution. Written by Kenneth Chisholm (kchishol@rogers.com)", "A documentary about the closure of General Motors' plant at Flint, Michigan, which resulted in the loss of 30,000 jobs. Details the attempts of filmmaker Michael Moore to get an interview with GM CEO Roger Smith. Written by Murray Chapman <muzzle@cs.uq.oz.au>", "The bizarre true story of Linda Riss and Burt Pugach.", "One of the most vivid depictions of the horrors of Nazi Concentration Camps. Filmed in 1955 at several concentration camps in Poland, the film combines new color and black and white footage with black and white newsreels, footage shot by the victorious allies, and stills, to tell the story not only of the camps, but to portray the horror of man's brutal inhumanity. Written by Bill Randolph <wlrlogos@hotmail.com>", "Errol Morris examines the incidents of abuse and torture of suspected terrorists at the hands of U.S. forces at the Abu Ghraib prison.", "In 1977, Roman Polanski was arrested in Los Angeles on charges he gave drugs and had sex with a 13-year-old girl he was photographing for Vogue. Eleven months later, having pled guilty to one count, he fled to Europe before sentencing. This film examines that year-long period, using archival footage of the media frenzy and of Polanski's life before the charges, clips from his films, and contemporary interviews with many of the principles - attorneys, the victim, and Polanski's friends and associates. Polanski remains enigmatic, but portraits emerge of the machinations of justice and of a judge more interested in his image than his word or the law. Written by <jhailey@hotmail.com>", "Using the torture and death in 2002 of an innocent Afghan taxi driver as the touchstone, this film examines changes after 9/11 in U.S. policy toward suspects in the war on terror. Soldiers, their attorneys, one released detainee, U.S. Attorney John Yoo, news footage and photos tell a story of abuse at Bagram Air Base, Abu Ghraib, and Guantanamo Bay. From Bush, Cheney, Rumsfeld, and Gonzalez came unwritten orders to use any means necessary. The CIA and soldiers with little training used sleep deprivation, sexual assault, stress positions, waterboarding, dogs and other terror tactics to seek information from detainees. Many speakers lament the loss of American ideals in pursuit of security. Written by <jhailey@hotmail.com>", "Documentary about Fred Leuchter, an engineer who became an expert on execution devices and was later hired by revisionist historian Ernst Zundel to \"prove\" that there were no gas chambers at Auschwitz. Leuchter published a controversial report confirming Zundel's position, which ultimately ruined his own career. Most of the footage is of Leuchter, puttering around execution facilities or chipping away at the walls of Auschwitz, but Morris also interviews various historians, associates, and neighbors. Written by ccampbell", "Portrayal of the late Bradford playwright Andrea Dunbar.", "\"Carl Panzram: The Spirit of Hatred and Revenge\" examines the life of serial killer and rapist Carl Panzram who lived from 1891 to 1930. It examines how his life hardened him into a psychotic murderer. It also examines how a prison guard Henry Lesser forged a friendship with him and encouraged him to write an autobiography. Written by Shatterdaymorn", "Portrays the lives of nine desperate teenagers. Thrown too young into a seedy grown up world, these runaways and castaways survive, but just barely. Rat, the dumpster diver. Tiny, the teen prostitute. Shellie, the baby-faced blonde. DeWayne, the hustler. All old beyond their years. All underage survivors fighting for life and love on the streets of downtown Seattle. Written by Fiona Kelleghan <fkelleghan@aol.com>", "The life and career of Muhammad Ali (1942- ) as seen chronologically in archival footage: Ali as a fighter, a personality, a political lightening rod, and a man. Boxers who fought him describe what led up to major fights and the matches themselves; they also offer personal revelations about their own lives: George Chuvalo's family losses, George Foreman's conversion, Ken Norton's gratitude, Ron Lyle's teaching, Earnie Shaver's encounter with the Klan, and Joe Frazier's good humor pack their own punch. The fighters talk about Ali's quickness, cunning, and recuperative powers - and how fighting him changed their lives. Written by <jhailey@hotmail.com>", "In the late 1960s and early 1970s polarization of American political situation was becoming acute, with the Vietnam War abroad and civil rights at home being the most pressing issues. For the youth political movement, seemingly ineffectual methods of peaceful protest and resistance led to the rise of a faction that wanted a more extreme approach that the government could not ignore. One particular group, the Weather Underground, attempted to team up with the Black Panthers to violently confront the US government. They began with participation in street riots, and escalated their efforts to include the bombing of specific targets associated with the government or local power structures. Thorough archival footage and interviews of participants on both sides of this conflict, this film covers the Weather Underground's campaign of violence through this period, the FBI's strategies and tactics to apprehend them (including some deemed unethical or illegal), until changing times and ... Written by Kenneth Chisholm (kchishol@rogers.com)", "In a country where 58% of African American 4th graders are functionally illiterate, The Lottery uncovers the failures of the traditional public school system and reveals that hundreds of thousands of parents attempt to flee the system every year. The Lottery follows four of these families from Harlem and the Bronx who have entered their children in a charter school lottery. Out of thousands of hopefuls, only a small minority will win the chance of a better future. The Lottery uncovers a ferocious debate surrounding the education reform movement. Interviews with politicians and educators explain not only the crisis in public education, but also why it is fixable. A call to action to avert a catastrophe in the education of American children, The Lottery makes the case that any child can succeed. Written by Anonymous", "Our intrepid defender of the working man, Michael Moore, documents his 1996 \"Downsize This!\" book tour across the USA. Shot on-the-cheap with a video camera, we once again watch our hero interview the working man at yet another plant closing, while also trying to get past corporate security guards to interview the millionaire CEOs. Written by Tim G. <kas@interlog.com>", "Chris Marker and Pierre Lhomme's LE JOLI MAI (The Lovely Month of May) is a portrait of Paris and Parisians during May 1962;the first springtime of peace after the ceasefire with Algeria and the first time in 23 years that France was not involved in any war. Written by Anonymous", "Executive Producer Sean Penn presents \"Witch Hunt,\" a gripping indictment of the American justice system told through the lens of one small town. Voters in Bakersfield, California elected a tough on crime district attorney into office for more than 25 years. During his tenure he convicted dozens of innocent working class moms and dads. They went to prison, some for decades, before being exonerated. He remains in office today. This story on a micro level mirrors what the US has experienced over the last eight years. When power is allowed to exist without oversight civil rights are in jeopardy. Written by Dana Nachman", "Documentary depicts what happened in Rio de Janeiro on June 12th 2000, when bus 174 was taken by an armed young man, threatening to shoot all the passengers. Transmitted live on all Brazilian TV networks, this shocking and tragic-ending event became one of violence's most shocking portraits, and one of the scariest examples of police incompetence and abuse in recent years. Written by fabreu@rio.com.br", "By the 1920's, Berlin had become known as a homosexual eden, where gay men and lesbians lived relatively open lives amidst an exciting subculture of artists and intellectuals. With the coming to power of the Nazis, all this changed. Between 1933 and 1945 100,000 men were arrested for homosexuality under Paragraph 175, the sodomy provision of the German penal code dating back to 1871. Some were imprisoned, others were sent to concentration camps. Of the latter, only about 4,000 survived. Today, fewer than ten of these men are known to be living. Five of them have now come forward to tell their stories for the first time in this powerful new film. The Nazi persecution of homosexuals may be the last untold story of the Third Reich. Paragraph 175 fills a crucial gap in the historical record, and reveals the lasting consequences of this hidden chapter of 20th century history, as told through personal stories of men and women who lived through it: the half Jewish gay resistance fighter who ... Written by Anonymous", "The rise, fall, and rebirth of Christian Hosoi, the young man who helped skateboarding re-emerge as a major cultural influence in the 1980s. The inventive skater and businessman was incarcerated in 2000 for trafficking controlled substances across state lines, and since his parole in 2004, the Born-Again Christian has dedicated his life to being a good father and positive influence on the sport. Written by Anonymous", "The War on Drugs has become the longest and most costly war in American history, the question has become, how much more can the country endure? Inspired by the death of four family members from \"legal drugs\" Texas filmmaker Kevin Booth sets out to discover why the Drug War has become such a big failure. Three and a half years in the making the film follows gang members, former DEA agents, CIA officers, narcotics officers, judges, politicians, prisoners and celebrities. Most notably the film befriends Freeway Ricky Ross; the man many accuse for starting the Crack epidemic, who after being arrested discovered that his cocaine source had been working for the CIA. AMERICAN DRUG WAR shows how money, power and greed have corrupted not just dope fiends but an entire government. More importantly, it shows what can be done about it. This is not some 'pro-drug' stoner film, but a collection of expert testimonials from the ground troops on the front lines of the drug war, the ones who are ... Written by Kevin Booth", "Searching for The Wrong-Eyed Jesus is a captivating and compelling road trip through the creative spirit of the the Southern U.S. Director Andrew Douglas's film follows \"Alt Country\" singer Jim White through a gritty terrain of churches, prisons, truck stops, biker bars and coal mines. This is a journey through a very real contemporary Southern U.S., a world of marginalised white people and their unique and home-made society. Along the way are road-side encounters with modern musical mavericks including The Handsome Family, Johnny Dowd, 16 Horsepower and David Johansen; old time banjo player Lee sexton; rockabilly and mountain Gospel churches - and novelist Harry Crews telling grisly stories down a dirt track. Written by Steve Haisman", "The gritty elements of urban crime and violence have always had an influence on hip hop culture and rap music. More and more, the trappings of street life have landed popular rap artists behind bars - and not just for a music video shoot. What happens when a rapper who has everything suddenly has his freedom stripped away and is forced to deal with the harsh realities of prison? \"Rhyme and Punishment\" takes an in-depth look at the role of prison in hip hop culture, and reveals the side of the story that is not being covered by the news and popular media. The true and personal stories of hip hop artists who are, have been, or are soon to be incarcerated, in their own words. Featuring intimate and compelling interviews with convicted rappers Beanie Sigel, Prodigy, Cassidy, Project Pat, Immortal Technique, Slick Rick and many more. These artists who were at the top of their game when they got locked up explain the details of the crimes that led to their arrests, and document their ... Written by Anonymous", "Documentary on Charles Manson and his family. Has a number of insightful interviews with many family members most notably Squeaky and Sandy (Blue and Red). There is also a history of Manson from his birth to the family formation to the Tate/La Bianca murders. Plenty of footage of the family playing at Spahn Ranch. Written by Josh Pasnak <chainsaw@intouch.bc.ca>", "This documentary tells the story of Jani, a 19-year-old drug addict living on social welfare among with his friends. Tired of his life in a remote city in Rovaniemi, he decides to travel by train to various parts of Europe before being sent to imprisonment for several petty crimes. Written by Vilzu83", "Through a focus on the life of Dalton Trumbo (1905-1976), this film examines the effects on individuals and families of a congressional pursuit of Hollywood Communists after World War II. Trumbo was one of several writers, directors, and actors who invoked the First Amendment in refusing to answer questions under oath. They were blacklisted and imprisoned. We follow Trumbo to prison, to exile in Mexico with his family, to poverty, to the public shunning of his children, to his writing under others' names, and to an eventual but incomplete vindication. Actors read his letters; his children and friends remember and comment. Archive photos, newsreels and interviews add texture. Written by <jhailey@hotmail.com>", "STOKED tells the story of 80s skateboarding icon and convicted killer Mark \"Gator\" Rogowski. Spanning a decade from the early 80s to early 90s, STOKED is the fascinating character study of a young man's development, couched within the social and historical framework of skateboarding's biggest era. STOKED takes a trip to the 'in-your-face' era of 80s youth pop culture, exploring the mechanism of fame and its darker consequences in one man. A thoughtful and energetic look back at the apex of punk rock, neon jams, and the early days of MTV, the archival documentary follows skateboarding from its grass roots in Southern California backyards to an international phenomenon. Featuring skateboarding legends such as Tony Hawk, Stacy Peralta, Lance Mountain, Steve Caballero, and testimony from Mark \"Gator\" Rogowski from behind bars, STOKED dramatically reveals for the first time the factors leading to a hero's tragic fall from grace, and the unyielding spirit that allows skateboarding to ... Written by Anonymous", "Most people know the lasting legacy of Harry Belafonte, the entertainer. This film unearths his significant contribution to and his leadership in the civil rights movement in America and to social justice globally.", "A twisted tale of murder, alleged police corruption and conniving opportunists that tracks the sensational trial and conviction of \"America's First Female Serial Killer.\"", "This film shows the Scared Straight program that has hardened convicts from maximum security prisons tell their stories about the truth about prison life in order to convince kids that no crime is worth the risk of being incarcerated Written by Kenneth Chisholm <kchishol@execulink.com>", "How a government wilfully withheld vital evidence from a court of law, deceived its public, orchestrated an unprecedented media campaign, and ruthlessly deployed its organs of state against one of its own citizens. Expendable presents, and demonstrates, the crushing, pre-meditated, and often brutal acts which a western government is prepared to inflict upon a helpless woman, Schapelle Corby, in pursuit of political expediency. Written by Anonymous", "Computer hackers are being portrayed as the newest brand of terrorists. This is a story of a hacker named Kevin Mitnick, imprisoned without bail for nearly five years. Freedom Downtime tries to uncover the reasons why the authorities are so scared of Mitnick as well as define what exactly he did. Surprisingly, no real evidence is ever presented by the authorities to back up the sensationalist claims in mass media. But when a Hollywood studio decides to make a movie about Mitnick's life through the eyes of one of his accusers, hackers turn to activism to get their message out. Through interviews with relatives, friends, lawyers, and experts in the computer and civil liberties arena, a picture of a great injustice becomes apparent. A cross-country journey uncovers some realities of the hacker culture as well as the sobering fact that so many technically young adept people are being imprisoned. Written by Anonymous", "An examination of the career of Jacques Vergès (1925- ), attorney for members of Algeria's FLN, Palestine's FPLP, the Khmer Rouge, Carlos and associates, Klaus Barbie, and other revolutionaries and outcasts. Archival footage, news articles, and photographs mix with contemporary interviews of Vergès, friends, associates, and historians. Connections with Nazis are explored, as well as Vergès's marriage to Djamila Bouhared, his courtroom methods, his disappearance from 1970 to 1978, and the roots of his radicalism. Throughout, Vergès remains playful and charming, with a soupçon of arrogance. The film suggests Vergès's anti-colonial nature is at his center. Written by <jhailey@hotmail.com>", "For two weeks, Theroux visits the San Quentin State Prison and talks with the guards and the inmates. The guards escort him, tell him what their job is all about and how the prison is subdivided while the inmates tell him there's a segregation of races that can't be undone. Theroux talks to David Silva, who's serving 521 years and 11 life sentences and to two gay couples. He also visits a group of inmates who are kept apart from the other inmates for their own safety. Written by Marco van Hoof <k_luifje7@hotmail.com>", "Naomi Klein gives a lecture tracing the confluence of ideas about modifying behavior using shock therapy and other sensory deprivation and modifying national economics using the \"shock treatment\" of Milton Friedman and the Chicago School. She moves chronologically: Pinochet's Chile, Argentina and its junta, Yeltsin's Russia, Bush and Bremer's Iraq. A trumped-up villain provides distraction or rationalization: Marxism, the Falklands, nuclear weapons, terrorists; and, always, there is a great shift of money and power from the many to the few. News footage, a narrator, and talking heads back up Klein's analysis. She concludes on a note of hope. Written by <jhailey@hotmail.com>", "Superpower is a well-executed and comprehensive film that asks tough questions and goes behind the scenes of America's national security apparatus and military actions. Far from a conspiracy film about the dangers of government secrets and regime change, this well-balanced film straddles the philosophical divide and allows viewers to understand the US quest for global dominance through economic and military strategy that is exposed through review of historical events, personal interviews, and analysis of US foreign policy. Written by Barbara-Anne Steegmuller", "Louis visits Coalinga Mental Hospital in California, home to over 500 convicted paedophiles, and spends some time with those undergoing treatment.", "For forty years, Charles Manson has survived most of his life in what he calls 'the hallways of the all ways,' the reform schools, jails and prisons that have been his home and tomb. His thought was born in the hole of solitary confinement, apart from time and beyond the grasp of society. In his cell, he created his own world and speaks his own language: he has concluded that there is only the mind. This DVD will relinquish to you the extreme story of the killer of all killers: Charles Manson. From convincing his followers to move into the desert to train for the apocalypse, to leading a murderous crew through a string of devilish murders, you will see and hear from Manson himself of how he created a preconceived terror based on his philosophy of life. Manson claims that the so-called 'straight' world outside of prison is but an inverted reflection of the underworld in which he has lived. To him, the reality that presidents and law-abiding citizens accept begins in the hermetic ... Written by Clint Weiler", "Imagine being a woman in a men's prison. For many individuals, this is a grim reality because the U.S. prison system decides where to place inmates based on their genitalia, not their gender identity. This award-winning documentary makes an unflinching examination of transgender women in men's prisons. Ashley, Linda, Anna, Yolanda and Ophelia describe their experiences undergoing inhumane and humiliating treatment including rape, violence, solitary confinement and denial of medial care. One interviewee explains. \"A lot of times I wake up, and I look around at my surroundings, and I see all these men. I think, 'What am I doing here?'\" The women in Cruel and Unusual don't deny that they must serve their sentences, but their stories raise very important questions about their treatment. Are the human rights of these women and many others across the United States violated? If Gender Identity Disorder is a recognized condition by the American Psychiatric Association, should inmates receive ... Written by Anonymous", "An hour in a prison in Baer Sheva, Israel. The documentary follows the departure of the prison manager and the coming of a new one, and the stir the change makes for the prisoners. The movie also takes us through the high walls and cells and day-to-day prison life; with stories of some of the prisoners: a father and son together in one cell, another who wants to get married eyeing for a parole, a 30- year-old that spent most of his life in prison. Written by Jonathan <jrd@netvision.net.il>", "The Garden is a desolate section of Tel Aviv where young gay prostitutes and drug addicts gather. It's a territory for the dispossessed (the irony of its name not lost on anyone who enters or escapes) and for pickups, drug deals, and clashes with the law. Over the course of one year, filmmakers Ruthie Shatz and Adi Barash follow two young men who have made the Garden their home: Nino, a 17-year-old Palestinian living illegally in Israel, in and out of jail and reformatories; and Dudu, an Arab-Israeli self- destructing under the debilitation of drug addiction. The young men give Shatz and Barash tremendous access into the most intimate aspects of their lives. The filmmakers, ever mindful of the trust they have earned, create a powerfully honest film, affording Nino and Dudu respect and dignity all too often denied them in their daily lives. Against the backdrop of the Israeli/Palestinian conflict, and the unease and ridicule still directed toward homosexuals, the two friends depend on ... Written by Anonymous", "Rita, an award winning recording artist, takes a pilgrimage to the birthplace of the blues... Louisiana State Maximum Security Penitentiary, a.k.a Angola Prison. She never imagined that her love for the blues would lead her to raise the roof in a collaborative jailhouse performance with inmates serving life sentences for murder, rape and armed robbery. Music has given these inmates something to live for behind the bars of what was once the bloodiest prison in America. It is their only escape. Steeped with hope, these remarkable voices guide us on a journey of men on a quest for forgiveness. One woman, four bands, and two hours of the Blues. It's time to make a new soundtrack. Written by Anonymous", ""], "Healthcare": ["Documentary look at health care in the United States as provided by profit-oriented health maintenance organizations (HMOs) compared to free, universal care in Canada, the U.K., and France. Moore contrasts U.S. media reports on Canadian care with the experiences of Canadians in hospitals and clinics there. He interviews patients and doctors in the U.K. about cost, quality, and salaries. He examines why Nixon promoted HMOs in 1971, and why the Clintons' reform effort failed in the 1990s. He talks to U.S. ex-pats in Paris about French services, and he takes three 9/11 clean-up volunteers, who developed respiratory problems, to Cuba for care. He asks of Americans, \"Who are we?\" Written by <jhailey@hotmail.com>", "Birth: it's a miracle. A rite of passage. A natural part of life. But more than anything, birth is a business. Compelled to find answers after a disappointing birth experience with her first child, actress Ricki Lake recruits filmmaker Abby Epstein to explore the maternity care system in America. Focusing on New York City, the film reveals that there is much to distrust behind hospital doors and follows several couples who decide to give birth on their own terms. There is an unexpected turn when director Epstein not only discovers she is pregnant, but finds the life of her child on the line. Should most births should be viewed as a natural life process, or should every delivery be treated as a potential medical emergency? Written by Anonymous", "A gripping tale of microbes, medicine and money, \"Under Our Skin\" exposes the hidden story of Lyme disease, one of the most controversial and fastest growing epidemics of our time. Each year, thousands go undiagnosed or misdiagnosed, often told that their symptoms are \"all in their head.\" Following the stories of patients and physicians fighting for their lives and livelihoods, the film brings into focus a haunting picture of the health care system and a medical establishment all too willing to put profits ahead of patients. Written by Open Eye Pictures", "\"A Walk to Beautiful\" tells the story of five women in Ethiopia suffering from devastating childbirth injuries. Rejected by their husbands and ostracized by their communities, these women are left to spend the rest of their lives in loneliness and shame. We follow each of these women on their journey to a special hospital in Addis Ababa where they find solace for the first time in years, and we stay with them as their lives begin to change. Through the intimate experiences all five share, we are no longer in the heart of Africa-we are in the hearts of these women. The trials they endure and their attempts to rebuild their lives tell a universal story of hope, courage, and transformation. Written by Mary Olive Smith", "Every minute in the United States, an ambulance gets turned away from an emergency room because hospitals are simply too full. In Los Angeles, where the wait time in some ERs is as long as 48 hours, the entire 911 system is being dragged down in ways that are alarming. FIRESTORM follows the Los Angeles Fire Department Station 65, located in South L.A., a neighborhood with a largely uninsured and undereducated population. The LAFD handles all emergency medical services for the city of Los Angeles, and currently 82% of the department's work is medical-rather than fire-related. Ten hospitals have closed in just five years in L.A., and the challenge of delivering more than 500 patients per day to a shrinking number of hospitals is overwhelming the LAFD. With resources strained, and 911 being used for everything from heart attacks to stomach aches, LAFD paramedics have become virtual 'doctors in a box' according to Fire Chief Daniel McCarthy. Shot cinema vérité, with candid interviews and ... Written by Julie Winokur", "An acclaimed documentary feature exploring the extraordinary journey of the Reuther brothers - Walter, Roy, and Victor - prolific labor statesman whose social justice movement, under the banner of the United Auto Workers union, transformed the landscape of a nation. Directed by Victor's grandson, Sasha, and narrated by Martin Sheen, the film is an in-depth study of one family's rise from auto plant organizers in 1930s Detroit to leaders in collective bargaining, Civil Rights activism, and international labor solidarity. Behind the dramatic headlines of picket line conflict, assassination attempts, heated Senate hearings, and inter-union power struggles, lies a stirring personal story of determination, sacrifice, triumph, and tragedy. This influential and often controversial 40-year crusade would contribute to lifting millions of workers to a middle-class living and compel American democracy to live up to its promise of equality. Written by Porter Street Pictures", "", "What if you died because your hospital considered you an expendable commodity? Today's health care costs are at an all-time high, and malpractice rates are climbing steadily. Yet some hospitals are making a fortune at patients' expense. The results are deadly, yet no one is being held accountable. Affected individuals -from patients to top level health care officials- speak out about the corruption, exposing the sinister side of health care in this dramatic lively expose. Written by Orb Film Productions", "Covers the key aspects of the world AIDS epidemic through powerful documentary stories about five victims and their communities, on five continents.", "As the Gulf War raged, the government forced its fighting men and women to be vaccinated with an experimental and unapproved vaccine against anthrax. In the aftermath of that fateful decision, large numbers of veterans now suffer from strange and debilating symptoms, a condition known as Gulf War Syndrome (GWF). Despite overwhelming evidence to the contrary, our Government and the Armed Forces refuses to acknowledge that the vaccine is the cause. Written by Anonymous", "", "An Iraqi mother seeks health care for her 10-year-old son, who is dying of AIDS, against a background of war and occupation.", "AS THE CALL, SO THE ECHO tells the story of an American surgeon who volunteers in a poverty stricken hospital in central Vietnam. When a woman with a deadly cancer is presented to him, he must struggle to save her life, fighting to overcome a language barrier, limited equipment, and his deepest fears. Written by Keir Moreano", "What if you had a disease doctors had never seen before? What if it couldn't be diagnosed or treated? What if you were starving because of it? What if you had disabling muscle pains? What if you skin burned constantly? What would you do? Would you give up or would you continue to search for answers? In the documentary 'Of Unknown Etiology', a graduate film student struggles to find answers to his health problems while simultaneously trying to document it for his thesis project. He faces challenges not only from his deteriorating health, but also from the mounting costs and frustrations of dealing with the American healthcare system. As his isolation and physical condition worsens he begins to wonder if he's even going to survive his disease at all, and, if he does, will he still be the same person? 'Of Unknown Etiology' is a first-person documentary that intimately explores the physical pain and psychological anguish that comes with suffering from a long-term chronic disease; yet it ... Written by Anonymous", "5th of a 5-part series. Former Surgeon General C. Everett Koop looks at the future of medicine.", "The action takes place in LeHigh County, Pennsylvania three days before the 2004 presidential election. Predicted to be one of the tightest races in the country - a swing county in a swing state that could decide the election; the race is in a dead heat. Progressives from out of state have mobilized against local conservatives in a fierce battle of organizational skill and stamina that extends beyond the political and becomes profoundly personal. But in the midst of this intense door-to-door combat that could determine the presidency, approximately 40% of those eligible won't even vote. This film explores their stories: Why they don't participate. How they feel about the process. And what it would take for them to become part of \"The World's Greatest Democracy.\" Written by Anonymous", "Follows Dr. Isaac Harry Sobol, Chief Medical Officer of the Northern Canadian Territory of Nunavut, and his volunteer medical team as they assemble and conduct a primary care clinic in a remote Tibetan village. Shot over one month, the film documents the team's treatment of nearly 1,500 indigent patients. Although gratifying, this work is not easy. The team labors for long hours, encountering late-stage conditions they wouldn't ordinarily see in Canada, and ethical complexities that are at the core of our North American health-care debates. High Plains Doctor brings viewers a rare window into the uncensored pain and disharmony in an isolated part of Tibet. Bridging health-care in Nunavut and Tibet, the film reveals disquieting parallels facing these aboriginal peoples. High Plains Doctor captures unforgettable images of life in a village since devastated by a 7.1 level earthquake. Written by Michael Oved Dayan", "", "", "", "Like clean water and unadulterated food and drugs, adequate healthcare is a condition of civilized life. As a nation, we worked to guarantee that Americans are protected against contaminated food and water. These chiefly 20th Century reforms were aimed at improving the health of the American people. Yet, again we find ourselves in a health crisis. The time has come to broaden our conception of public health policy to include the entirety of the delivery of health services. We are a group of non-partisan concerned citizens producing a documentary film which will engage the research and opinions of some of the smartest people our country doesn't know and present viable options for universal healthcare. We will be speaking with professors, doctors, Rhode Scholars and other critical thinkers to present one or several viable plans that will ensure proper healthcare for all Americans. This is a not for profit endeavor and we are raising the money through tax deductible donations. Visit our ... Written by Dana Offenbach", "This documentary follows the inspirational journey of six volunteers with the Australian Youth Ambassadors for Development (AYAD) program on their roller coaster ride into the unknown. The AYAD program, which supports young Australians who want to live and work in a developing country, is funded by AusAID, the Australian Government's Agency for International Development. Every year, the AYAD program places 400 young Australians on short-term assignments in countries across the Asia Pacific region and beyond. Shot in five countries over 6 months, the documentary, No Ordinary Journey, follows six AYADs on an adventure where they make a difference and forge friendships that will never be broken. Written by The Production Hub", "Oli is a 99 year old housebound, eccentric ex-headmistress and millionaire, whose daily struggle is increased by a world that seems to have forgotten her as she lives in her rat infested condemned home with her Shetland pony.", "What happens when children become caregivers for disabled family members? With a hidden population of over 1.4 million kids caring for sick and disabled family members each day, the film is a timely and deeply affecting look at two girls, Shayna and Kassandra, who help their families to care for disabled brothers. A tender portrait of sibling relationships, and the sacrifices that these grown-up girls have make each day to keep their family together. Written by Anonymous", "Addressing one of the most complex and critical issues facing America today - a health care system so badly broken that millions go without coverage and some 18,000 people die each year as a result. It recounts the toll on individuals and entire communities in Tennessee following the single largest Medicaid dis-enrollment in history. In 2005, when Governor Phil Bredesen of Tennessee announced he would reform his state's Medicaid program, people took him at his word. Little did they know that Bredesen's idea of reform meant cutting 190,0000 people off the program almost overnight. The size and speed of the cuts were unprecedented; the suffering they caused was immeasurable. The sickest, neediest people were denied medical care while the nation sat by and watched, and the Governor boasted to other heads of states about his success reigning in the rising cost of health care. The story is told through the eyes and emotions of Tennesseans struggling to get adequate care and those fighting ... Written by Anonymous", "", ""], "Immigration": ["After background about the childhood and youth of John Lennon (1940-1980) and the birth of Vietnam-War protests, the film plunges into Lennon's quest for world peace: compositions such as \"Give Peace a Chance\", the lie-in following his marriage to Yoko Ono, appearances at concerts, \"War Is Over\" posters, and plans for a series of concerts in 1972 in U.S. presidential primary states reach newly-enfranchised young voters. This plan for concerts, in particular, led a prominent Senator, the FBI's J. Edgar Hoover, and Nixon's White House to initiate a concerted and illegal effort to deport Lennon. Thirty talking heads, led by Yoko, comment on Lennon and these events. Written by <jhailey@hotmail.com>", "Ric Burns (brother of the famed documentarian Ken Burns) presents an exhaustive history of New York City from the settling of the area by the Dutch to the attack by terrorists nearly 400 years later. Told in a sentimental tone, Burns weaves a lyrical tale of the great metropolis that encompasses not only the city's streets, but also that of the history of America. Though around fourteen hours in length, this epic documentary presents a thoughtful, entertaining look at our relatively young country. Written by Chris Bogner", "Six Americans are tasked by a frontier medical examiner with retracing the footsteps of three dead migrants - three of the nearly 6,000 illegal immigrants who perished in the desert in the last 15 years while crossing from Mexico. Gathered at the morgue, the participants are handed three case files and told, \"We've given them a name. You must give them a story.\" The six, from all walks of life, first explore the issue on the U.S. side, embedding with law enforcement and Arizona ranchers angry at the cartels that now control not just the drug trade but the migrant routes as well. Then, split into three groups, they head for Mexico and Central America, learning about the lives of the migrants they've been asked to follow. In a twist, the medical examiner instructs the six to work their way back to the United States alongside real migrants by whatever means necessary ... on river rafts, on foot through gang-controlled jungle and, once regrouped, on top the infamous cargo train known as ... Written by Anon", "Two top baseball prospects in the Dominican Republic face fierce competition and corruption as they chase their big league dreams.", "This TV documentary series was produced by the BBC back in 1986 and is about the people known as The Celts who lived in many areas of Europe around 2000 years ago.", "Superpower is a well-executed and comprehensive film that asks tough questions and goes behind the scenes of America's national security apparatus and military actions. Far from a conspiracy film about the dangers of government secrets and regime change, this well-balanced film straddles the philosophical divide and allows viewers to understand the US quest for global dominance through economic and military strategy that is exposed through review of historical events, personal interviews, and analysis of US foreign policy. Written by Barbara-Anne Steegmuller", "After acknowledging his own immigrant background, Malle, tries to present the range of immigrant experiences in the US during the 1980's. In an attempt to be comprehensive, the film includes interviews with migrant workers and illegal entrants along the Mexican border, conversations with an enterprising Indian motel owner, coverage of industrious African and Asian families in the cities, an extensive interview with the first Costa Rican astronaut, visits with Cuban exiles in Miami, several conversations with West Indian poet Derek Walcott, an extended portrait of the deposed Nicaraguan General Samoza (the surviving brother of Anastasio Somoza Debayle) and his extended family. The film finishes with a brief visit to the Russian Jewish community in Brooklyn, NY to tie in with the centenary of the Statue of Liberty. Written by Maple-2", "", "An intriguing exploration of the Asian massage parlor industry in Providence, RI, where a 25 year-old loophole has made the exchange of sex for money legal - as long as it happens behind closed doors. As the documentary follows a recent Korean immigrant, \"Heather\", working to operate her spa, the city's mayor fights to change the law that allows her business a legal existence. The film includes interviews with Korean women who work in spas, clients who frequent the spas, politicians from 1980 and today, police, local news footage, radio call-in shows and \"voiced\" reviews from inter-net escort review boards. Written by Tara Hurley", "Depicts the remarkable life of artist Don Bachardy and his relationship with the distinguished writer Christopher Isherwood. Includes footage shot by Chris and Don in the 1950s and interviews with Leslie Caron, John Boorman, Liza Minnelli, and others. Isherwood and Bachardy were open about their life together, regardless of the waves it caused. This was during a period when gay relationships were not acceptable. The age difference in their relationship brought obvious personal problems that had to be addressed. Don often felt disregarded by Chris's famous friends and frequently was. Nevertheless, Bachardy pursued his art career with great energy, painting and drawing every day. Finding a vocation gave Don a sense of fulfillment and independence. He began to realize that he could function independently, which made him question whether he wanted to stay with Isherwood. Don toyed with leaving the relationship and striking out on his own, however he decided not to as he realized his love ... Written by Asphalt Stars Productions", "The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America.", "The ostensibly simple story of a sympathetic veteran teacher giving Italian lessons to a weekly class of diverse immigrants is given infinitely more depth and complexity by the manner in which director Daniele Gaglianone renders his story. Blurring the lines between fact and fiction, truth and artifice, and between documentary and drama, Gaglianone has created a film within a film. You see the apparent artifice of Gaglianone's crew using professionals, including the noted film actor Valerio Mastandrea as the teacher, interlinked with 'real' immigrant protagonists, studying the language to improve their chances of employment and of gaining a permanent residence permit. Thus in the course of the lessons there is simultaneously the painful and upsetting relation of the students' personal stories but also humour, as they interact and share their humanity, bridging cultural differences, united in their striving to make a better life for themselves. Written by AnonymousB", "In the early days of March 1991, a number of ships laden with people made their appearance on Italy's Adriatic shores, marking what would later be known as the 'Albanian Exodus'. Who were the people on the ships? Where were they fleeing from? And where are they today. This is the story of a journey, the story of the ships and of the people who fled on them. Written by Anonymous", "In 1962, a trash fire ignited a seam of anthracite coal beneath Centralia, Pennsylvania, a once thriving mining town of over 1600 people. By the mid 1980's, giant plumes of smoke and deadly carbon monoxide gases billowed from fissures in the ground, the local highway cracked and collapsed, trees were bleached white and petrified, as the fire continued to rage unchecked. It wasn't until a young boy nearly died after falling into a smoldering mine subsidence that the government was pressed into action. After estimating the cost of extinguishing the fire at over a half a billion dollars, the government opted to raze the town and relocate its residents. Today, 11 die-hards remain. Filmed over a period of five years with interviews ranging from former residents to Congressmen, The Town That Was is an intimate portrait of John Lokitis, the youngest remaining Centralian, and his quixotic fight to keep alive a hometown that has literally disintegrated under his feet. His unbowed determination... Written by Georgie Roland, Chris Perkel", "Sir Martin Gilbert, author of over sixty books and the host of A&E's JERUSALEM, hosts this gripping account of Israel's difficult first years. Filled with rare footage, photographs, and interviews with participants in the War of Independence, this is the definitive document of one of the turning points in modern history. Extraordinary footage filmed by Bernard Beecham, a British soldier, shows the reality of life in the fledgling nation, when all efforts were devoted toward winning the war. Written by Fiona Kelleghan <fkelleghan@aol.com>", "In a barren desert, surrounded by limitless horizon, there stands a 700 mile perforated barrier separating the haves and the have not's. The sun sets along this rusty fence as a crusty old veteran puffs a cigarette and lowers his binoculars. The day is over, but the cold night is theirs. He lowers the flag, salutes a helicopter passing through the darkness, and settles into his dusty camper for another canned meal alone on Patriot Point. Written by Nicholas Weissman", "At the 63rd Street Hot and Crusty cafe, residents of New York's Upper East Side get bagels and coffee served with a smile 24 hours a day. But behind the scenes, undocumented immigrant workers face sub-legal wages, dangerous machinery, and abusive managers who will fire them for calling in sick. Mild-mannered sandwich maker Mahoma López has never been interested in politics, but in January 2012, he convinces a small group of his co-workers to fight back. Risking deportation and the loss of their livelihood, the workers team up with a diverse crew of innovative young organizers and take the unusual step of forming their own independent union, launching themselves on a journey that will test the limits of their resolve. In one roller-coaster year, they must overcome a shocking betrayal and a two-month lockout. Lawyers will battle in court, Occupy Wall Street protesters will take over the restaurant, and a picket line will divide the neighborhood. If they can win a contract, it will set a... Written by Rachel Lears and Robin Blotnick", "The history and culture of the legendary inhabitants (the \"hillbillies\") of Appalachia.", "A behind the scenes look at the everyday happenings from the people that work at one of the world's busiest international airports, Heathrow.", "\"El Inmigrante\" is a documentary film that examines the Mexican and American border crisis by telling the story of Eusebio de Haro a young Mexican migrant who was shot and killed during one of his journeys north. The film presents a distinct humanitarian focus in which story and character take precedent over policy and empiricism. Towards this end \"El Inmigrante\" examines the perspectives of a diverse cast of players in this border narrative. A cast which includes the de Haro family, the community of Brackettville, Texas-where Eusebio was shot, members of vigilante border militias in Arizona, the horseback border patrol in El Paso, and migrants en route to an uncertain future in the United States. Written by John Eckenrdoe", "", "Based on over 700 interviews in Mexican towns where about half the population has left to work in the United States, The Other Side of Immigration asks why so many Mexicans come to the U.S. and what happens to the families and communities they leave behind. Through an approach that is both subtle and thought-provoking, filmmaker Roy Germano provides a perspective on undocumented immigration rarely witnessed by American eyes, challenging audiences to imagine more creative and effective solutions to the problem. \"There are inevitably real people behind the strident slogans and ideological labels in today's immigration debate. Roy Germano's The Other Side of Immigration does more than any other work to give people otherwise disparaged as 'threatening' and 'illegal' a human face and to reveal the devastating personal effects of U.S. immigration and economic policies on our closest neighbors.\" - Douglas S. Massey, Princeton University Written by Anonymous", "With Americans on all sides of the issue up in arms and Congress embroiled in a knock-down-drag-out policy battle over how to move forward, CROSSING ARIZONA tells the story of how we got to where we are today. Heightened security in California and Texas has pushed illegal border-crossers into the treacherous Arizona desert in unprecedented numbers - an estimated 4,500 a day. Most are Mexican men in search of work, but increasingly the border-crossers are women and children seeking to reunite with their husbands and fathers. This influx of migrants crossing through Arizona and the attendant rising death toll have elicited complicated feelings about human rights, culture, class, labor and national security. \"Crossing Arizona\" examines the crisis through the eyes of those directly affected by it. Frustrated ranchers go out day after day to repair cut fences and pick up the trash that endangers their livestock and livelihoods. Humanitarian groups place water stations in the desert in an ... Written by Crossing AZ LLC", "In the film, couples, whose love is put to a special test, give us insight into their lives. One partner of each couple is not originally from Europe and the lovers find themselves confronted with immigration law and its impact. The director combines very different facets into an exciting, very moving and strongly expressive documentary mosaic. A compelling, filmic plea for love without borders. Written by Anonymous", "This documentary film takes us to an in-depth look at the asylum process of the federal U.S. Immigration and Naturalization Service (INS). Foreigners that are already in the United States, having fled their home countries, have the opportunity to apply for asylum through the INS. If a person's case establishes a \"well-founded fear\" of his/her home country, the adjudicating immigration officer approves his/her asylum application. If a person's case does not quite meet up to the officer's expectation of a \"well-founded fear,\" it is referred to an immigration judge for a decision. Written by Oliver Chu", "Documentary about new United States immigrants spanning all fifty states.", "\"Once Upon a Time in Cabramatta\" is the untold story of how the Vietnamese community overcame the odds and found their place in multicultural Australia. The story begins with the landmark decision of Prime Minister Fraser to open Australia's doors to thousands of refugees at the end of the Vietnam War. It is a moment in history that finally buries the infamous White Australia Policy and transforms a nation. The years that follow are as dramatic as they are turbulent - a people struggling to find their place in a foreign land. In this one tiny Sydney suburb, the 80s and 90s see the arrival of street gangs, a heroin epidemic and the first political assassination in Australia's history. The Vietnamese people are vilified and demonised. Cabramatta it seems represents all that is wrong with Asian immigration. What's more the community exist against a political backdrop that is fractured, the universal support for multiculturalism a distant memory. But as the century draws to a close there ... Written by Once Upon a Time Productions", "Emotional interviews with members of the Turkish community in Ninove, a Flemish city notorious for being the most politically right winged in Belgium.", "Program provides an historical archive of how gangsters took advantage of changes in public policy to gain wealth and power in the first half of the twentieth century and how they met their ends. The post World War I raise and fall of bank robbery gangs is briefly described. Written by David Foss", "Weaving together the lives of different people from different countries who all share a quest for citizenship by choice, not birthright, this documentary travels from a citizenship class in San Jose to a naturalization ceremony in Iraq. Along the way, there's unprecedented access to the United States Citizenship and Immigration Service, revealing the complex process up-close, including a marriage interview and the one-on-one Citizenship Exam. How many amendments are in the Constitution? To become an American, not knowing is not an option. Contemporary stories of struggle and success are combined with insightful interviews from notable naturalized citizens like Fareed Zakaria, Alan Cumming, David Rakoff and Isabel Allende. Written by History", "A look into Canada's incredible strides with progressive politics, while at the same time the U.S. has become increasingly polarized on such issues as the Drug War and Gay-marriage. Canada now presents a sharp contrast between itself and its southern neighbor, making converts of many a U.S. citizen. Written by Juxtapose", "Both moving and thought-provoking, The Dream is Now brings this pressing issue to America's attention, where we can all debate, discuss, and decide for ourselves what is right, what is fair, and what is best for our nation.", "Set within Chicago's labyrinth of alleyways, Scrappers is a cinema verite portrait of Otis and Oscar, two scrap metal scavengers searching for a living with brains, brawn and battered pickup trucks. The film shows how globalization, the 2008 financial crisis, crackdowns on undocumented immigrants and widespread scrap metal theft effect these men and their families. Written by Ben Kolak", "The Apple Pushers, narrated by Edward Norton, follows the inspiring stories of five immigrant pushcart vendors who are rolling fresh fruits and vegetables into New York City's food deserts - neighborhoods where finding a ripe, red apple is a serious challenge and where obesity rates are skyrocketing. These micro-entrepreneurs, who hail from Ecuador, Russia, Mexico, and Bangladesh, are at the heart of a unique urban strategy, the Green Cart Initiative, which seeks to increase the availability of fresh produce in under-served communities, in an effort to combat the obesity epidemic found in so many of America's cities. Written by Anonymous", "In the course of living long months with a group of Iranian illegals in Athens, the director examines this radical choice of pursuing a better life through the most perilous of possibilities: clandestinity.", "Part documentary, part personal essay, this experimental film combines archive imagery with the striking wintry landscapes of Alaska to tell the story of immigrant experience coming into the UK from 1960 onwards.", "One February day in 2007, a man from the Department of Homeland Security arrived at Gloria Garza's house in South Texas. He asked her to sign a letter granting permission to build a 25 foot Wall on her property. She thought it was joke. A small town, a border sheriff, and two illegal immigrants all become intertwined by one 25-foot Wall. Filmed over two years along the Southwest, The Wall is a documentary about the construction of a fence along the Mexican border. Congress had the blueprints but they never planned for human nature. Written by Ricardo Martinez", "In the heart of Jerusalem stands an unusual symbol of unity that defies generations of segregation, violence and prejudice: a gay bar called Shushan. CITY OF BORDERS goes inside this vibrant underground sanctuary on the East/West border of the Holy City, where people of opposing nationalities, religions and sexual orientations create a community among people typically viewed as each other's \"enemy.\" The documentary follows the daily lives of the five Israeli and Palestinian patrons as they navigate the minefield of politics, religion and discrimination to live and love openly. In observing the lives of the bar regulars, CITY OF BORDERS explores the bond forged when people from warring worlds embrace what everyone shares in common - the right to be accepted and belong - rather than be defined, or limited by the differences that tear them apart. Written by Yun Suh", "A documentary look at the fate of Mexicans who cross the border into the United States.", "", "Made in L.A. follows the remarkable story of three Latina immigrants working in Los Angeles garment sweatshops as they embark on a three-year odyssey to win basic labor protections from a mega-trendy clothing retailer. In intimate verité style, Made in L.A. reveals the impact of the struggle on each woman's life as they are gradually transformed by the experience. Compelling, humorous, deeply human, Made in L.A. is a story about immigration, the power of unity, and the courage it takes to find your voice. Written by Anonymous", "Traces the history of Irish immigration to the United States, following the stories of several families and their journeys to America, including where they ended up. Written by Eric Sproul <esproul@wlu.edu>", "An epic documentary touching upon 150 years of the Chinese diaspora in Canada, USA, New Zealand and Australia; covering four generations of racism as revealed through the journey and family story of Kenda Gee. Based on over 12 years of research and two-years in the making. Also offered as a 2-part television mini series for the Canadian Broadcasting Corporation (CBC TV), Prime-time Summer Series (world premiere in Alberta and Saskatchewan). Preliminary Screener RUN-TIME: 1:28:42 (88 mins). Written by Anonymous", "", "The children of immigration, here to stay, are the new Americans. How we fare in welcoming them will determine the nature of this country in the 21st century and beyond. The International High School is a New York City public school dedicated to serving newly arrived immigrant teenagers, with more than 300 students speaking two-dozen languages from 50 countries. The students strive to master English, adapt to families they haven't seen in years, confront the universal trials of adolescence, and search for a future they can claim as their own. In \"I Learn America,\" five resilient immigrant teenagers come together over a year at the International High School at Lafayette and struggle to learn their new land. Through these five vibrant young people, their stories and struggles, and their willingness to open their lives and share them with us, we \"learn America.\" Written by I Learn America, LLC", "An illustration of the teasing of the Montreal's Italians between their love of what was their home country and their need, like many immigrants and sons of immigrants, to be accepted and integrated in their new society. From the history of the Italian immigration seen through the play 'La Storia dell'Immigrante' from 'Toni Nardi' and Vincenzo Ierfino to the screening in the Caffe Italia of a World Cup soccer game involving the Italian Team. Written by Jean-Marie Berthiaume <jiembe@videotron.ca>", "", "Walking the Line offers a harrowing view of the chaos along the U.S.-Mexico border through private citizens who are taking the law into their own hands. Following a growing movement of anti-immigrant vigilantes, some clad in fatigues and armed with semi-automatic weapons, the documentary provides a scathing critique of our failed border policy. Written by Jeremy Levine and Landon Van Soest", "A group of teenagers from Berlin with various migration background analyze through a theater work the US Civil Rights Movement in order to understand how to survive and react against the racial brutality of German police and society.", "Airing on HBO March 24, The Senators' Bargain is the concluding film of \"How Democracy Works Now,\" a documentary series that brings the viewer behind the scenes of American democracy and shows how change happens at every level of government. The Senators' Bargain plunges viewers directly into the backstage reality of a remarkable moment -- before the 2008 elections, before the bailouts, before Tea Partiers -- when a high-stakes bill six years in the making had a chance to change American immigration policy. But deep at the heart of this fast-moving story, below the level of strategy and protocol, we find a moral tale of modern American politics. Ted Kennedy, one of the handful of people who, through his personal efforts had truly changed the face of America, now would be forced to decide: how much did he want this deal, and what was he willing to trade for his greatest legacy. Written by Anonymous"], "Poverty": ["In the early 1970s, Sixto Rodriguez was a Detroit folksinger who had a short-lived recording career with only two well received but non-selling albums. Unknown to Rodriguez, his musical story continued in South Africa where he became a pop music icon and inspiration for generations. Long rumored there to be dead by suicide, a few fans in the 1990s decided to seek out the truth of their hero's fate. What follows is a bizarrely heartening story in which they found far more in their quest than they ever hoped, while a Detroit construction laborer discovered that his lost artistic dreams came true after all. Written by Kenneth Chisholm (kchishol@rogers.com)", "The story of the monumental life and tragic death of legendary Brazilian motor-racing Champion, Ayrton Senna. Spanning the decade from his arrival in Formula One in the mid 80's, the film follows Senna's struggles both on track against his nemesis, French World Champion Alain Prost, and off it, against the politics which infest the sport. Sublime, spiritual yet, on occasion, ruthless - Senna conquers and transcends Formula One to become a global superstar. Privately, he is humble, almost shy, and fiercely patriotic, donating millions to his native Brasil and contemplating a life beyond motor-racing. Yet he is struck down in his prime on the blackest weekend in the history of the sport, watched live on television by 300 million people. Years on he is revered in Formula One as the greatest motor racing driver of all time - and in Brasil as a Saint. Written by Anonymous", "The United States of America is notorious for its astronomical number of people killed by firearms for a developed nation without a civil war. With his signature sense of angry humor, activist filmmaker Michael Moore sets out to explore the roots of this bloodshed. In doing so, he learns that the conventional answers of easy availability of guns, violent national history, violent entertainment and even poverty are inadequate to explain this violence when other cultures share those same factors without the equivalent carnage. In order to arrive at a possible explanation, Michael Moore takes on a deeper examination of America's culture of fear, bigotry and violence in a nation with widespread gun ownership. Furthermore, he seeks to investigate and confront the powerful elite political and corporate interests fanning this culture for their own unscrupulous gain. Written by Kenneth Chisholm (kchishol@rogers.com)", "Filmed over nearly five years in twenty-five countries on five continents, and shot on seventy-millimetre film, Samsara transports us to the varied worlds of sacred grounds, disaster zones, industrial complexes, and natural wonders.", "Following up on 'Bowling for Columbine', film-maker Michael Moore provides deep and though-provoking insights on the American security system, the level of paranoia, fear, uncertainty, false values and patriotism, which all combined together to set a stage for George W. Bush to launch a war on Iraq instead of focusing on getting the real culprit(s) behind the terrorist attacks of September 11, 2001. This documentary also focuses on how some Saudis were safely and secretly flown out of America while planes were ostensibly grounded after the attacks. Archived film footage, candid interviews with politicians, and an overall waste of public funds for a war that was initiated on false pretension to wit: a weapon of mass distraction - to take the focus away from the real enemy and get Americans glued to their TV sets to watch innocent Iraqis and Afghans getting killed. And a war that would eventually alienate the U.S.A. and it's citizens from almost every country on Earth. Written by rAjOo (gunwanti@hotmail.com)", "Bill Maher interviews some of religion's oddest adherents. Muslims, Jews and Christians of many kinds pass before his jaundiced eye. Maher goes to a Creationist Museum in Kentucky, which shows that dinosaurs and people lived at the same time 5000 years ago. He talks to truckers at a Truckers' Chapel. (Sign outside: \"Jesus love you.\") He goes to a theme park called Holy Land in Florida. He speaks to a rabbi in league with Holocaust deniers. He talks to a Muslim musician who preaches hatred of Jews. Maher finds the unlikeliest of believers and, in a certain Vatican priest, he even finds an unlikely skeptic. Written by J. Spurlin", "Located alongside the Tennessee River, Muscle Shoals, Alabama is the unlikely breeding ground for some of America's most creative and defiant music. Under the spiritual influence of the 'Singing River' as Native Americans called it, the music of Muscle Shoals changed the world and sold millions upon millions of copies. At its heart is Rick Hall who founded FAME Studios. Overcoming crushing poverty and staggering tragedies, he brought black and white together in Alabama's cauldron of racial hostility to create music for the generations while giving birth to the 'Muscle Shoals Sound' and 'The Swampers'. Mick Jagger, Keith Richards, Percy Sledge, Gregg Allman, Clarence Carter, Etta James, Alicia Keys, Bono, and others bear witness to Muscle Shoals' magnetism, mystery, and why it remains influential today. Written by Anonymous", "Without words, cameras show us the world, with an emphasis not on \"where,\" but on \"what's there.\" It begins with morning, natural landscapes and people at prayer: volcanoes, water falls, veldts, and forests; several hundred monks do a monkey chant. Indigenous peoples apply body paint; whole villages dance. The film moves to destruction of nature via logging, blasting, and strip mining. Images of poverty, rapid urban life, and factories give way to war, concentration camps, and mass graves. Ancient ruins come into view, and then a sacred river where pilgrims bathe and funeral pyres burn. Prayer and nature return. A monk rings a huge bell; stars wheel across the sky. Written by <jhailey@hotmail.com>", "This documentary follows two inner-city Chicago residents, Arthur Agee and William Gates, as they follow their dreams of becoming basketball superstars. Beginning at the start of their high school years, and ending almost 5 years later, as they start college, we watch the boys mature into men, still retaining their \"Hoop Dreams\". Both are recruited into the same elite high school as their idol, former Detroit Piston superstar Isiah Thomas. Only one survives the first year; the other must return to a high school closer to his home. Along the way, there is much tragedy, some joy, a great wealth of information about inner city life, and the suspense of not knowing what will occur next. This is not a \"by-the-numbers\" film. Written by Anonymous", "\"Nanking\" tells the story of the rape of Nanking, one of the most tragic events in history. In 1937, the invading Japanese army murdered over 200,000 and raped tens of thousands of Chinese. In the midst of the horror, a small group of Western expatriates banded together to save 250,000 -- an act of extraordinary heroism. Bringing an event little-known outside of Asia to a global audience, \"Nanking\" shows the tremendous impact individuals can make on the course of history. It is a gripping account of light in the darkest of times. Written by Anonymous", "A feature length documentary work which presents a case for a needed transition out of the current socioeconomic monetary paradigm which governs the entire world society. This subject matter will transcend the issues of cultural relativism and traditional ideology and move to relate the core, empirical \"life ground\" attributes of human and social survival, extrapolating those immutable natural laws into a new sustainable social paradigm called a \"Resource-Based Economy\". Written by ArchGunner", "An uplifting feature documentary highlighting the transformative power of art and the beauty of the human spirit. Top-selling contemporary artist Vik Muniz takes us on an emotional journey from Jardim Gramacho, the world's largest landfill on the outskirts of Rio de Janeiro, to the heights of international art stardom. Vik collaborates with the brilliant catadores, pickers of recyclable materials, true Shakespearean characters who live and work in the garbage quoting Machiavelli and showing us how to recycle ourselves. Written by Anonymous", "A couple embarks on a journey home for Chinese new year along with 130 million other migrant workers, to reunite with their children and struggle for a future. Their unseen story plays out as China soars towards being a world superpower.", "", "Blood Brother is an intimate portrait of Rocky Braat, a young man who longed to find a family. He didn't know it, but this desire would lead him to an AIDS hostel in India, a place of unspeakable hardship, where he would find almost more love and need than he could bear. Written by Blood Brother", "Fueled by a raging libido, Wild Turkey, and superhuman doses of drugs, Thompson was a true \"free lance, \" goring sacred cows with impunity, hilarity, and a steel-eyed conviction for writing wrongs. Focusing on the good doctor's heyday, 1965 to 1975, the film includes clips of never-before-seen (nor heard) home movies, audiotapes, and passages from unpublished manuscripts. Written by Anonymous", "Bombay Beach is one of the poorest communities in southern California located on the shores of the Salton Sea, a man-made sea stranded in the middle of the Colorado desert that was once a beautiful vacation destination for the privileged and is now a pool of dead fish. Film director Alma Har'el tells the story of three protagonists. The trials of Benny Parrish, a young boy diagnosed with bipolar disorder whose troubled soul and vivid imagination create both suffering and joy for him and his complex and loving family. The story of CeeJay Thompson, a black teenager and aspiring football player who has taken refuge in Bombay Beach hoping to avoid the same fate of his cousin who was murdered by a gang of youths in Los Angeles; and that of Red, an ancient survivor, once an oil field worker, living on the fumes of whiskey, cigarettes and an irrepressible love of life. Together these portraits form a triptych of manhood in its various ages and guises, in a gently hypnotic style that ... Written by Anonymous", "A documentary that investigates incidents of hunger experienced by millions of Americans, and proposed solutions to the problem.", "In August 2005, the American city of New Orleans was struck by the powerful Hurricane Katrina. Although the storm was damaging by itself, that was not the true disaster. That happened when the city's flooding safeguards like levees failed and put most of the city, which is largely below sea level, underwater. This film covers that disastrous series of events that devastated the city and its people. Furthermore, the gross incompetence of the various governments and the powerful from the local to the federal level is examined to show how the poor and underprivileged of New Orleans were mistreated in this grand calamity and still ignored today. Written by Kenneth Chisholm (kchishol@rogers.com)", "A look behind the scenes of the Czech gay porn boom. Porn producer Dan Komar, and his ex-lover/star Aaron Hawke, shown what life is like on both sides of the camera.", "The life and career of Muhammad Ali (1942- ) as seen chronologically in archival footage: Ali as a fighter, a personality, a political lightening rod, and a man. Boxers who fought him describe what led up to major fights and the matches themselves; they also offer personal revelations about their own lives: George Chuvalo's family losses, George Foreman's conversion, Ken Norton's gratitude, Ron Lyle's teaching, Earnie Shaver's encounter with the Klan, and Joe Frazier's good humor pack their own punch. The fighters talk about Ali's quickness, cunning, and recuperative powers - and how fighting him changed their lives. Written by <jhailey@hotmail.com>", "In the late 1960s and early 1970s polarization of American political situation was becoming acute, with the Vietnam War abroad and civil rights at home being the most pressing issues. For the youth political movement, seemingly ineffectual methods of peaceful protest and resistance led to the rise of a faction that wanted a more extreme approach that the government could not ignore. One particular group, the Weather Underground, attempted to team up with the Black Panthers to violently confront the US government. They began with participation in street riots, and escalated their efforts to include the bombing of specific targets associated with the government or local power structures. Thorough archival footage and interviews of participants on both sides of this conflict, this film covers the Weather Underground's campaign of violence through this period, the FBI's strategies and tactics to apprehend them (including some deemed unethical or illegal), until changing times and ... Written by Kenneth Chisholm (kchishol@rogers.com)", "A documentary on American political campaign marketing tactics and their consequences.", "Documentary depicts what happened in Rio de Janeiro on June 12th 2000, when bus 174 was taken by an armed young man, threatening to shoot all the passengers. Transmitted live on all Brazilian TV networks, this shocking and tragic-ending event became one of violence's most shocking portraits, and one of the scariest examples of police incompetence and abuse in recent years. Written by fabreu@rio.com.br", "Admist the apparent growing prosperity of India, there is a dark underbelly of poverty of another side of the nation that is little known. This film is a chronicle of filmmakers Zana Briski and Ross Kauffman's efforts to show that world of Calcutta's red light district. To do that, they inspired a special group of children of the prostitutes of the area to photograph the most reluctant subjects of it. As the kids excel in their new found art, the filmmakers struggle to help them have a chance for a better life away from the miserable poverty that threatens to crush their dreams. Written by Kenneth Chisholm (kchishol@rogers.com)", "Two Surfers. One Dream. Finding Faith On The Journey Of A Lifetime.", "Near Penn Station, next to the Amtrak tracks, squatters have been living for years. Marc Singer goes underground to live with them, and films this \"family.\" A dozen or so men and one woman talk about their lives: horrors of childhood, jail time, losing children, being coke-heads. They scavenge, they've built themselves sturdy one-room shacks; they have pets, cook, chat, argue, give each other haircuts. A bucket is their toilet. Leaky overhead pipes are a source of water for showers. They live in virtual darkness. During the filming, Amtrak gives a 30-day eviction notice. Written by <jhailey@hotmail.com>", "One of the most astonishing and engaging cinematic works of the past decade, CHILDREN UNDERGROUND is a profoundly intimate and heart-wrenching drama about homeless children struggling for survival on the streets and in the subways of Bucharest, Romania. Written by Anonymous", "", "Whitwell Middle School in rural Tennessee is the setting for this documentary about an extraordinary experiment in Holocaust education. Struggling to grasp the concept of six-million Holocaust victims, the students decide to collect six-million paper clips to better understand the extent of this crime against humanity. The film details how the students met Holocaust survivors from around the world and how the experience transformed them and their community. Written by Sujit R. Varma", "The woes of Detroit are emblematic of the collapse of the U.S. manufacturing base. Is the Midwestern icon actually a canary in the American coal mine? DETROPIA is a cinematic tapestry of a city and its people who refuse to leave the building, even as the flames are rising. Written by Loki Films", "A train speeds through the country on its way to Berlin, then gradually slows down as it pulls into the station. It is very early in the morning, about 5:00 AM, and the great city is mostly quiet. But before long there are some signs of activity, and a few early risers are to be seen on the streets. Soon the new day is well underway - it's just a typical day in Berlin, but a day full of life and energy. Written by Snow Leopard", "An exploration of technologically developing nations and the effect the transition to Western-style modernization has had on them.", "Searching for The Wrong-Eyed Jesus is a captivating and compelling road trip through the creative spirit of the the Southern U.S. Director Andrew Douglas's film follows \"Alt Country\" singer Jim White through a gritty terrain of churches, prisons, truck stops, biker bars and coal mines. This is a journey through a very real contemporary Southern U.S., a world of marginalised white people and their unique and home-made society. Along the way are road-side encounters with modern musical mavericks including The Handsome Family, Johnny Dowd, 16 Horsepower and David Johansen; old time banjo player Lee sexton; rockabilly and mountain Gospel churches - and novelist Harry Crews telling grisly stories down a dirt track. Written by Steve Haisman", "Part live stand-up performance, part documentary, this film is one of comedian Richard Pryor's later stand-up performances. As foul-mouthed as ever, Pryor touches on most of the same topics as in his previous live shows.", "", "A documentary on how the spirit of unity, which buoyed Britain during the war years, carried through to create a vision of a fairer, united society.", "A 24-part series which deals with the relations between the United States, the Soviet Union and their respective allies between the end of World War II to the collapse of the Soviet Union in 1991.", "", "Through a focus on the life of Dalton Trumbo (1905-1976), this film examines the effects on individuals and families of a congressional pursuit of Hollywood Communists after World War II. Trumbo was one of several writers, directors, and actors who invoked the First Amendment in refusing to answer questions under oath. They were blacklisted and imprisoned. We follow Trumbo to prison, to exile in Mexico with his family, to poverty, to the public shunning of his children, to his writing under others' names, and to an eventual but incomplete vindication. Actors read his letters; his children and friends remember and comment. Archive photos, newsreels and interviews add texture. Written by <jhailey@hotmail.com>", "Ric Burns (brother of the famed documentarian Ken Burns) presents an exhaustive history of New York City from the settling of the area by the Dutch to the attack by terrorists nearly 400 years later. Told in a sentimental tone, Burns weaves a lyrical tale of the great metropolis that encompasses not only the city's streets, but also that of the history of America. Though around fourteen hours in length, this epic documentary presents a thoughtful, entertaining look at our relatively young country. Written by Chris Bogner", "The first in Stefan Jarl's Mods Trilogy, the film documents the life of two teenagers, Kenta and Stoffe. With interviews from the two boys and their friends about their hedonistic lifestyle, and what their future holds, the film explores the highs and lows of mod life in 1960s Stockholm, Sweden. Written by thepooloflust", "Yael Hersonski's powerful documentary achieves a remarkable feat through its penetrating look at another film-the now-infamous Nazi-produced film about the Warsaw Ghetto. Discovered after the war, the unfinished work, with no soundtrack, quickly became a resource for historians seeking an authentic record, despite its elaborate propagandistic construction. The later discovery of a long-missing reel complicated earlier readings, showing the manipulations of camera crews in these \"everyday\" scenes. Well-heeled Jews attending elegant dinners and theatricals (while callously stepping over the dead bodies of compatriots) now appeared as unwilling, but complicit, actors, alternately fearful and in denial of their looming fate. Written by Sundance Film Festival", "A comedic documentary which follows The Yes Men, a small group of prankster activists, as they gain world-wide notoriety for impersonating the World Trade Organization on television and at business conferences around the world. The film begins when two members of The Yes Men, Andy and Mike, set up a website that mimics the World Trade Organization's--and it's mistaken for the real thing. They play along with the ruse and soon find themselves invited to important functions as WTO representatives. Delighted to represent the organization they politically oppose, Andy and Mike don thrift-store suits and set out to shock unwitting audiences with darkly comic satire that highlights the worst aspects of global free trade. Written by Sujit R. Varma", "This ambitious documentary/drama/animation hybrid stars Pete Postlethwaite as an archivist in the devastated world of the future, asking the question: \"Why didn't we stop climate change when we still had the chance?\" He looks back on footage of real people around the world in the years leading up to 2015 before runaway climate change took place. Written by Adela Pickles", "A look at what happened after Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan (2006) was filmed in the Romanian village of Glod. It follows the life of one girl who longs to escape the poverty as foreign lawyers arrive with the promise of suing 20th Century Fox for millions of dollars.", "This documentary deals with work, poverty, violence, love and sex. A film about human beauty in twelve chapters which tells the tales of people from Bombay, Mexico City, Moscow and New York, who are all struggling for survival, with ingenuity, intelligence and dignity. They all share the dream of a better life. Written by L.H. Wong <lhw@sfs.org.sg>", "A true account of life on an English housing estate. With those on Government handouts, drugs, booze & long-term unemployment.", "A gritty, provocative true-life story of three friends from the 'hood, Rameck Hunt, Sampson Davis, and George Jenkins, who made a pact in high school to find a way to go to college and then medical school. They not only accomplished this, but they're now spreading the word to inspire other inner-city kids to stay off of drugs, out of gangs and to take the educational route to a better life. THE PACT captures the pathos of the men's individual journeys, the integrity of their voices and the power of their rare friendship. Their stories affirm the values that ultimately sustained and drove them: courage, tenacity, and faith. And they give tribute to the life of the mind and its power to turn dreams into reality. Written by Andrea Kalin", "Three children living in a displacement camp in northern Uganda compete in their country's national music and dance festival."], "War/Anit-War": ["Following up on 'Bowling for Columbine', film-maker Michael Moore provides deep and though-provoking insights on the American security system, the level of paranoia, fear, uncertainty, false values and patriotism, which all combined together to set a stage for George W. Bush to launch a war on Iraq instead of focusing on getting the real culprit(s) behind the terrorist attacks of September 11, 2001. This documentary also focuses on how some Saudis were safely and secretly flown out of America while planes were ostensibly grounded after the attacks. Archived film footage, candid interviews with politicians, and an overall waste of public funds for a war that was initiated on false pretension to wit: a weapon of mass distraction - to take the focus away from the real enemy and get Americans glued to their TV sets to watch innocent Iraqis and Afghans getting killed. And a war that would eventually alienate the U.S.A. and it's citizens from almost every country on Earth. Written by rAjOo (gunwanti@hotmail.com)", "An intimate look at the Woodstock Music & Art Festival held in Bethel, NY in 1969, from preparation through cleanup, with historic access to insiders, blistering concert footage, and portraits of the concertgoers; negative and positive aspects are shown, from drug use by performers to naked fans sliding in the mud, from the collapse of the fences by the unexpected hordes to the surreal arrival of National Guard helicopters with food and medical assistance for the impromptu city of 500,000. Written by Dan Hartung <dhartung@mcs.com>", "For three days in 1971, former US soldiers who were in Vietnam testify in Detroit about their war experiences. Nearly 30 speak, describing atrocities personally committed or witnessed, telling of inaccurate body counts, and recounting the process of destroying a village. The atrocities are casual, seem routine, and are sanctioned or committed by officers. Images from the war illustrate the testimony; there's a side discussion among veterans about racism and a couple of interviews about the soldiers' self-realization. The testimony appears in the US Congressional Record on April 6 and 7, 1971. A \"winter soldier\" contrasts with Paine's \"summer soldier and sunshine patriot.\" Written by <jhailey@hotmail.com>", "Fueled by a raging libido, Wild Turkey, and superhuman doses of drugs, Thompson was a true \"free lance, \" goring sacred cows with impunity, hilarity, and a steel-eyed conviction for writing wrongs. Focusing on the good doctor's heyday, 1965 to 1975, the film includes clips of never-before-seen (nor heard) home movies, audiotapes, and passages from unpublished manuscripts. Written by Anonymous", "In the late 1960s and early 1970s polarization of American political situation was becoming acute, with the Vietnam War abroad and civil rights at home being the most pressing issues. For the youth political movement, seemingly ineffectual methods of peaceful protest and resistance led to the rise of a faction that wanted a more extreme approach that the government could not ignore. One particular group, the Weather Underground, attempted to team up with the Black Panthers to violently confront the US government. They began with participation in street riots, and escalated their efforts to include the bombing of specific targets associated with the government or local power structures. Thorough archival footage and interviews of participants on both sides of this conflict, this film covers the Weather Underground's campaign of violence through this period, the FBI's strategies and tactics to apprehend them (including some deemed unethical or illegal), until changing times and ... Written by Kenneth Chisholm (kchishol@rogers.com)", "After background about the childhood and youth of John Lennon (1940-1980) and the birth of Vietnam-War protests, the film plunges into Lennon's quest for world peace: compositions such as \"Give Peace a Chance\", the lie-in following his marriage to Yoko Ono, appearances at concerts, \"War Is Over\" posters, and plans for a series of concerts in 1972 in U.S. presidential primary states reach newly-enfranchised young voters. This plan for concerts, in particular, led a prominent Senator, the FBI's J. Edgar Hoover, and Nixon's White House to initiate a concerted and illegal effort to deport Lennon. Thirty talking heads, led by Yoko, comment on Lennon and these events. Written by <jhailey@hotmail.com>", "This film recounts the history and attitudes of the opposing sides of the Vietnam War using archival news footage as well as its own film and interviews. A key theme is how attitudes of American racism and self-righteous militarism helped create and prolong this bloody conflict. The film also endeavors to give voice to the Vietnamese people themselves as to how the war has affected them and their reasons why they fight the United States and other western powers while showing the basic humanity of the people that US propaganda tried to dismiss. Written by Kenneth Chisholm <kchishol@execulink.com>", "This film shows the disaster of the Kuwaitian oil fields in flames. In contrast to the common documentary film there are no comments and few interviews. What must have been the hell itself is presented to the viewer in such beautiful sights and beautiful music that one has to be fascinated by it. The German title translates 'lessons in darkness'. Written by Oliver Heidelbach", "Produced at the height of the Vietnam War, Emile de Antonio's Oscar-nominated 1968 documentary chronicles the war's historical roots. With palpable outrage, De Antonio (Point of Order, Underground) assembles period interviews with journalists, politicians, and key military personnel and international newsreel and archival footage to create a scathing chronicle of America's escalating involvement in this divisive conflict. The savage and horrific images speak for themselves in perhaps the most controversial film of de Antonio's career, and the film he cites as his personal favorite. Written by Anonymous", "The film documents the alternative festival, made to protest against the Eurovision Song Contest held in Stockholm 1975. There are many Swedish and international artists on stage, as well as some clips from speeches, riots, civil wars, and the people at the song contest itself. Written by Per Johansson <hawklord@one.se>", "Archival footage, animation, and music are used to look back at the eight anti-war protesters who were put on trial following the 1968 Democratic National Convention.", "In the late Spring of 1970, nationwide protests against the war in Vietnam focused in the Wall Street area of New York City and ultimately in a major anti-war demonstration in Washington, D.C. A group of New York University film students documented the demonstrations as they happened in both cities. Later, in New York, the massive amount of black and white and color 16mm footage was edited into this important record of the day by day events. The extended final scene, shot by Edward Summer in a hotel room in Washington, D.C., is a spontaneous conversation among Martin Scorsese, Harvey Keitel, Jay Cocks and Verna Bloom who, along with a large group of NYU students, found themselves frustrated and perplexed by the events and hopeful that the protests would result in change. Written by E. Summer", "A documentary that explores the counterculture of San Francisco in the mid-1960's. In HD.", "Body of War is a documentary following Tomas Young, an Iraq War veteran paralyzed from a bullet to the spine, on a physical and emotional journey as he adapts to his new body and begins to question the decision to go to war in Iraq. From soldier to anti-war activist, the film takes an unflinching view of the physical and emotional aftermath of war through the eyes of an American hero. The film unfolds on two parallel tracks. On the one hand, we see Tomas evolving into a powerful voice against the war as he struggles to deal with the complexities of a paralyzed body. And on the other hand, we see the historic debate unfolding in the Congress about going to war in Iraq. Written by Ellen Spiro", "The 1960's alumni of the Berkeley campus tell their stories about how the quiet school became the site of massive political activism on the part of students fighting for their right of political expression on campus and then against the Vietnam War. Written by Kenneth Chisholm <kchishol@execulink.com>", "A documentary about a political troupe headed by actors Jane Fonda and Donald Sutherland which traveled to towns near military bases in the US in the early 1970s. The group put on shows called \"F.T.A.\", which stood for \"F**k the Army\", and was aimed at convincing soldiers to voice their opposition to the Vietnam War, which was raging at the time. Various singers, actors and other entertainers performed antiwar songs and skits during the show. Written by frankfob2@yahoo.com", "The filmmaker's subjects are patriotic young Americans - ordinary men and women who heeded the call for military service in Iraq - as they experience recruitment and training, combat, homecoming, and the struggle to reintegrate with families and communities. The terrible conflict in Iraq is a prelude for the even more challenging battles fought by the soldiers returning home - with personal demons, an uncomprehending public, and an indifferent government. As these battles take shape, each soldier becomes a new kind of hero, bearing witness and giving support to other veterans, and learning to fearlessly wield the most powerful weapon of all - the truth. Written by Focus Features", "Interviews with people involved with and leading the Madison, Wisconsin area resistance to the Vietnam war.", "On New Year's Eve, 1969, a flamboyant ragtag troupe of genderbending hippies took the stage of San Francisco's Palace Theater and The Cockettes were born. For the next 2 1/2 years, these outrageous drag performers created 20 shows with titles like \"A Crab on Uranus Means You're Loved\" and \"Tinsel Tarts in a Hot Coma,\" and were featured in four underground films. But when the Cockettes flew to New York City to appear Off Broadway - well, you'll just have to see what happened when New Yorkers took a look at them. Documentarians Weissman and Weber have crafted a record of a wondrous time and a wild group in The Cockettes. Written by Anonymous", "We've been told again and again that sports and politics don't mix, that games are just games and athletes should just 'shut up and play.' But according to Nation magazine sports editor Dave Zirin, this notion is just flat-out wrong. In 'Not Just a Game', the powerful new documentary based on his bestselling book 'The People's History of Sports in the United States', Zirin argues that far from providing merely escapist entertainment, American sports have long been at the center of some of the major political debates and struggles of our time. The result is as deeply moving as it is exhilarating: nothing less than an alternative history of political struggle in the United States as seen through the games its people have played. Written by Anonymous", "Three young men from the South known as the 'Three Musketeers' fly with the Royal Air Force in World War I. One, John McGavock Grider, is killed in action. His diary is published after the war and becomes a huge publishing success. Much later it is revealed that the diary was actually written by his friend Springs, who felt responsible for Grider's death. Written by Robert Clem", "", "Interviews with varied U.S officials and experts offer a deconstruction on the Bush administration's case for war in Iraq in the wake of 9/11.", "", "This documentary on the \"youth movement\" of the late 1960s focuses on the hippie pot smoking/free love culture in the San Francisco Bay area. Included are discussions of the drug scene with some of the kids themselves and, naturally, several examples of the hippie philosophy of peace, love and gratuitous nudity. Written by frankfob2@yahoo.com", "In 1988 director Kevin Tomlinson interviewed a group of back-to-the-land hippies at a 'healing gathering' in rural Washington State practicing peace and love. Now, in this poignant examination of this community over time, he tracks down those original interviewees and their children twenty years later to find out what the glories and sufferings of living out of the mainstream and off the grid might really look like. Written by Anonymous", "A documentary on Senator John Kerry's Navy tour of duty in Vietnam, his contributions to the peace movement that followed, and the ultimate shape of his future political career.", "", "A documentary about the 1951 sci-fi film \"The Day the Earth Stood Still,\" featuring clips from the film and interviews with some of the cast and crew about the making of the film.", "This documentary series explores the nature of modern war and the institutions that deal with this dangerous aspect of our world, such as training methods, military society, nuclear weapons, the peace movement and the historical developments that led us to this situation. Furthermore, this series explores them with a basic theme; that war has become fundamentally too massive and cataclysmicly destructive for modern civilization to continue using it and expect to survive Written by Kenneth Chisholm <kchishol@execulink.com>", "There are years when nothing happens and then days that change the course of History. From September 2002 to May 2003 we met with intellectuals, journalists, university professors, writers, historians, political analysts, international observers, human rights organizations, civil rights fighters, religious leaders, peace and anti war activists, asking questions to understand these years in which we are living and try to put together the many pieces of a complicated puzzle. The picture that comes alive is - to paraphrase James Baldwin - \"longer, larger, more various, more beautiful, and more terrible than anything anyone has ever said about it\". 2000 Presidential Elections and September 11, 2001. Afghanistan, Iraq, terrorism and weapons of mass destruction. Saddam Hussein and the inspections. The axis of evil, the coalition of the willing and collateral damages. News, media, concentrations of power and censorship. The Middle East and the old and new colonialism. Civil liberties and ... Written by The Cat's Dream", "Atomic Ed & the Black Hole tells the story of a scientist-turned-atomic junk collector known as Atomic Ed. More than 30 years ago, Ed quit his job making \"better\" atomic bombs and he began collecting what he calls \"nuclear waste,\" non-radioactive high-tech discards from the Los Alamos National Laboratory. As the self-appointed curator of an unofficial museum of the nuclear age called \"The Black Hole,\" Atomic Ed reveals and preserves a history of government waste that was literally thrown in a trash heap. Written by Ellen Spiro", "", "Silent America Not in our name is the rallying cry for thousands of Americans who continue to oppose the war in Iraq... See full synopsis »", "As the 2007-08 presidential campaign cycle offered up the usual slate of Washington insiders, Ron Paul, an obscure Congressman from Texas brought an alternative voice that challenged the political establishment. Advocating a philosophy of sound money, a non-interventionist foreign policy, strict Constitutionalism, and individual liberty, Dr. Paul inspired a unique grassroots movement unmatched in American history - the repercussions of which continue to reverberate today and into the future of the American psyche. For Liberty: How the Ron Paul Revolution Watered the Withered Tree of Liberty follows this historic campaign from the perspective of grassroots activists, and showcases the unique, often bizarre, yet groundbreaking projects they undertook as they brushed aside traditional campaign methodology. Written by Chris Rye", "This documentary depicts the wild swinging youth scene of the turbulent 60's, with in-depth footage of hippies doing a protest march against the Vietnam war in Washington, D.C., a rowdy New Jersey biker club called the Aliens letting it all hang out, and kids having themselves a groovy good time at a funky Florida rock festival. Written by Woodyanders", "68 travels back in time to the Vietnam war, the Prague uprising, Paris riots and the revolutionary Americas. It tells the stories of Dubcek, Che Guevara, De Gaulles, Luther King, Bob Kennedy. Based on exceptional documents, and the music of the times, from Jimi Hendrix to Jim Morrison, it reviews this critical year from an international perspective. Written by Anonymous", "", "", "A mixture of puppets, diagrams, animation and live action presents an anti-war message.", "An anti-war documentary in which the narrative written by James Hilton and spoken by Fredric March---who did not play Himself---makes no propaganda statement one way or the other, but the cameras clearly identify the aggressors. Shot in Poland, Danzig, England and France, the events depicted, and the people/citizens themselves, are a grim reminder of the horrors of war. Written by Les Adams <longhorn1939@suddenlink.net>", "Dr. Charlie Clements, who left the U.S. Air Force in 1970 after refusing to fly any more combat missions in Vietnam, discusses his gradual shift from a military background to being an opponent of the war and eventually becoming a doctor with the American Friends Service Committee, assisting the rural population of El Salvador during that country's civil war. Written by scgary66", "After the brutal murder of his son in Iraq, peace activist Michael Berg decides to run for congress to put an end to the war.", "A few Americans have been conscientious objectors (COs) in every one of America's wars. But World War II, the \"Good War\", posed a special problem for men of conscience. Out of 16 million called to serve in the armed forces, only 42,000 refused to participate in the killing due to religious, moral, philosophical, or political convictions. But rarely for lack of courage: 25,000 served as military noncombatants, often in war zones. Some volunteered for dangerous medical experiments, enduring starvation diets and inoculation with live hepatitis virus. About 3,000 others staffed mental hospitals. Their efforts to change the horrible conditions they found led to lasting reform in the care of the mentally ill. Over 7,000 men refused any alternative service on principle and went to prison. After the war was over, COs continued to work for social and political causes. They helped to relieve the suffering of war survivors by taking the place of soldiers returning from Europe and Asia. Former ... Written by yortsnave", "Disarm filmmakers Mary Wareham (Next Step Productions) and Brian Liu (Toolbox DC) present a contemporary and provocative view of the forces challenging the achievement of a mine-free world. Disarm spans a dozen countries to look at how, despite a global ban, millions of antipersonnel mines continue to claim victims daily in more than eighty countries. Defined as a conventional weapon, antipersonnel mines inflict mass destruction upon civilian populations for decades after the initial conflict ends. Despite some twenty thousand casualties a year, mines continue to be used and stockpiled by governments and rebel groups. Disarm juxtaposes government and public opinion, that of diplomats, mine victims, deminers, soldiers and aid workers to explore the issues that both hinder and further the case against antipersonnel mines. Visually stunning, Disarm features harrowing footage smuggled out of isolated nation of Burma, scenes from war-ravaged Colombia and Iraq, never-before-seen helmet ... Written by Anonymous", "Five young activists with diverse convictions embark on a quest to affect political change, each in their own unique way. But can regular citizens really change the system nowadays? The 60's activist, Tom Hayden, advises them and compares his own experiences. Amazingly, in the process, these individuals must change themselves. Written by Anonymous", "", "What happened to the hippies, the yippies, the Black Panthers, the counter- culture kids who rocked the nation's boat in the 1960's? Are they still fighting their fight, have they been co-opted into the culture they fought to overthrow, or were they destroyed by the culture while they struggled? Morley Markson shows us archival footage of some of the leaders - Jery Rubin, Abbie Hoffman, Fred Hampton, John Sinclair, among others - as well as people like poet Allen Ginsburg and lawyer William Kunstler, who represented the Chicago 8 during that seminal trial in 1969 - and then interviews them watching the old footage, to find an answer those questions. Written by Gary Dickerson <slug@mail.utexas.edu>", "Barack Obama's election marks the end of the Bush era. Bush has left behind a nation divided, in debt, and locked in a terrible war. For months, Republicans and Democrats squared up for the main event. Alongside the candidates, the parties, the powerful business lobbies, the religious groups and the unions, a relative newcomer was part of the battle. MoveOn has rocked the foundations of the American political system. In a span of just ten years, they have become a force to be reckoned with in America. They empowered long-disenchanted citizens, building the ultimate fund raising machine, fighting conservative domination of the national debate and, laptop in hand, rewriting the playbook for politics in the 21st century. Written by unknown", "A German boy goes to live with his cousin in America during the depression but when war breaks out, he finds himself fighting under a different flag against his cousin and everything he has come to believe in. Written by Anonymous"], "Women's Rights": ["For the first time in history the tables have turned on men. In the past \"Witch-Hunt\" was associated with women but now it is associated with men. In an effort to protect our children society has started to isolate men. This documentary explores the pedophilia hysteria and how all men are viewed as potential pedophiles. How did society come to such a conclusion and what are the political and social consequences? Have men really become victims of modern sexism or is the increase in sexism justified? Are All Men Pedophiles? Written by Jan-Willem Breure", "In 1972, a seemingly typical shoestring budget pornographic film was made in a Florida hotel, \"Deep Throat,\" starring Linda Lovelace. This film would surpass the wildest expectation of everyone involved to become one of the most successful independent films of all time. It caught the public imagination which met the spirit of the times, even as the self appointed guardians of public morality struggled to suppress it, and created, for a brief moment, a possible future where sexuality in film had a bold artistic potential. This film covers the story of the making of this controversial film, its stunning success, its hysterical opposition along with its dark side of mob influence and allegations of the on set mistreatment of the film's star. In short, the combined events would redefine the popular appeal of pornography, even as more cynical developments would lead it down other paths. Written by Kenneth Chisholm (kchishol@rogers.com)", "Once relegated to the margins of society, pornography has emerged as one of the most visible and profitable sectors of the cultural industries, assuming an unprecedented role in the mainstream of our popular culture at the same time that its content has become more extreme and harsh, more overtly sexist and racist. This eye-opening and disturbing film tackles the complexity behind this seeming paradox, placing the voices of critics, producers, and performers alongside the observations of men and women as they candidly discuss the role pornography has played in shaping their sexual imaginations and relationships. Honest and non-judgmental, The Price of Pleasure moves beyond the liberal versus conservative debates so common in the culture to paint a myth-busting and nuanced portrait of how pleasure and pain, commerce and power, liberty and responsibility have become intertwined in the most intimate area of our lives. An ideal tool for initiating classroom discussion about this ... Written by The Media Education Foundation", "A documentary road-movie about 7 young women's artists on tour on a bus, all over Europe this summer, who create on stage a manifesto on feminism, sex, art and education.", "A look at the life of activist, musician, and cultural icon Kathleen Hanna, who formed the punk band Bikini Kill and pioneered the \"riot grrrl\" movement of the 1990s.", "Rosanna Arquette informally interviews several contrasting actresses about how they cope with being a woman in the entertainment industry. The chauvenism of male crew is discussed, the pretentiousness / stereotyping of female characters in American film now. Interviews include those with Alley Sheedy, Martha Plimpton, Debra Winger, Emmanual Beart, and Rosanna's sister, Patricia Arquette -among others. Although a documentary this film seems affected, Arquette never has an argument, never says anything bad about another actress, in fact, complimenting just about everyone of them as being her favourite actress. Written by kerryn wedgwood", "It has launched both purity balls and porn franchises, defines a young woman's morality-but has no medical definition. Enter the magical world of virginity, where a white wedding dress can restore a woman's innocence and replacement hymens can be purchased online. Filmmaker Therese Shechter uses her own path out of virginity to explore why our sex-crazed society cherishes this so-called precious gift. Along the way, we meet sex educators, virginity auctioneers, abstinence advocates, and young men and women who bare their tales of doing it-or not doing it. \"How To Lose Your Virginity\" uncovers the myths and misogyny surrounding a rite of passage that many obsesses about but few truly understand. Written by Eve Charlier", "This documentary is an examination of the pornography industry such as in strip shows, sex shows, film and magazines. Furthermore, the film explores how a large portion of it takes a denigrating view of women, leading up to depictions of sexual violence for titillation. Written by Kenneth Chisholm (kchishol@rogers.com)", "A look at the history of the comic book publication that launched such legendary characters as Superman, Batman and Wonder Woman.", "Three young women face seven years in a Russian prison for a satirical performance in a Moscow cathedral. But who is really on trial in a case that has gripped the nation and the world beyond, three young artists or the society they live in? Written by Anonymous", "", "Bundelkhand in central India, a region notorious for its rebels-turned-armed bandits, is witnessing a new kind of rebellion with an unusual cast of characters. These are the pink sari-clad women of the Gulabi Gang, who use words as weapons - demanding their rights, submitting petitions and haranguing corrupt officials. They travel long distances by cart and tractor, bus and train, to wrest justice for women and dalits, undeterred by sneering policemen and condescending bureaucrats. Sampat Pal, the group's founder, is a rough-and-tough woman with a commanding personality. Despite being born into a traditional family and married off early, she has evolved her own brand of feminism and egalitarian politics. Constantly on the move, today she may be found investigating the suspicious death of a young woman, tomorrow protesting against a corrupt official. The Gulabi Gang, with a membership of thousands, is active across many districts. Suman Singh, one of the leaders, has made it her ... Written by Piraya Film", "For decades, Diana Vreeland was one of the leading authorities in fashion through eccentric self-taught skill and a bold stylistic audacity. This film guides you through this fashion pioneer's long career from her youth in Paris until she became a leading magazine fashion columnist and editor. In this medium, Vreeland challenged its preconceptions to present a new definition of beauty and vivaciousness where nice clothes were just the beginning for something deeper. Even when that vocation ended, Vreeland managed to gain a new museum profession to present clothing's history in her own inimitable way. Written by Kenneth Chisholm (kchishol@rogers.com)", "\"EDGEPLAY: A film about The Runaways\" chronicles the rise and disintegration of the seminal '70's all-teenage-girl rock band The Runaways, whose members included then-unknown future rock stars Lita Ford and Joan Jett. The film explores the effects of verbal, emotional and psychological abuse on girls too young to drink, but old enough for sex, drugs and rock n' roll. Written by Sacred Dogs Entertainment", "The anus is universal and anyone, male or female, could encounter these problems. You're better off knowing, and following this natural physical therapy session.", "A look at the largest brothel in Europe, the women working there, and the men who visit the place.", "Mutantes sheds light on a feminism that was little talked about in France. This documentary comprises of a series of interviews conducted in the USA, Paris and Barcelona, and documents from the archives about the political action of sex workers, queer activists and post-pornographic performances. Written by Morgane Production", "", "CNBC takes a behind the scenes look at the Porn Industry and examines challenges facing the industry including censorship and the competition from free online porn. It also looks at the executive and production roles that are now being filled with women and interviews pornographic actress Jesse Jane. Written by Shatterdaymorn", "THE ONLY REAL GAME explores the power of baseball for people in a remote and troubled place. The once princely state of Manipur, in volatile northeast India, defies gun violence, trafficking, and HIV/AIDS through a surprising passion for America's National Pastime. Manipur entered the Indian Union under protest in 1949, triggering a corrosive Separatist conflict. For decades baseball has delivered release from daily struggles and a dream for healing a wounded society. This dream moves toward reality when First Pitch - a band of baseball-loving New Yorkers - and two Major League Baseball Envoy coaches join Manipuri men, women and children to \"Play Ball.\" This Manipuri story brings us to the heart of the Great American Game - or as Babe Ruth called it, \"the only real game in the world.\" Written by Mirra Bank", "", "Takes a look at the rise and fall of Linda Lovelace, the first porn star.", "\"don't need you\" is a documentary film that tells the story of the origins of Riot Grrrl in the American independent music scene of the 1990s, and how this feminist movement evolved into a revolutionary underground network of education and self-awareness through music, writing, activism, and women-friendly community. The film gives audiences a chance to meet key figures in the development of Riot Grrrl and see for themselves how these women have changed the history of music and feminism forever. The film features one-on-one interviews interspersed with rare, archival materials, including original Riot Grrrl fanzines, flyers, and photographs, as well as seldom seen footage from pioneering Riot Grrrl bands like Bikini Kill, Heavens to Betsy, and Bratmobile. Written by Anonymous", "Mark Rappaport's creative bio-pic about actress Jean Seberg is presented in a first-person, autobiographical format (with Seberg played by Mary Beth Hurt). He seamlessly interweaves cinema, politics, American society and culture, and film theory to inform, entertain, and move the viewer. Seberg's many marriages, as well as her film roles, are discussed extensively. Her involvement with the Black Panther Movement and subsequent investigation by the FBI is covered. Notably, details of French New Wave cinema, Russian Expressionist (silent) films, and the careers of Jane Fonda, Vanessa Redgrave, and Clint Eastwood are also intensively examined. Much of the film is based on conjecture, but Rappaport encourages viewers to re-examine their ideas about women in film with this thought-provoking picture. Written by Tad Dibbern <DIBBERN_D@a1.mscf.upenn.edu>", "A documentary that celebrates and examines an unabashed vulgarian.", "When did feminism become a bad word? Why is it that young independent, progressive women in today's society feel uncomfortable identifying with the F-word? Join filmmaker Therese Shechter as she takes a funny, moving and very personal journey into the heart of Feminism, circa 2005. Armed with a video camera and an irreverent sense of humor, Therese talks with Feminist superstars, rowdy frat boys, liberated Cosmo girls and Radical Cheerleaders, all in her quest to find out whether Feminism can still be a source of personal and political power. Written by Anonymous", "", "Leila Khaled was the first woman to hijack a plane. In 1969, she showed her grenades to the terrified passengers by order of the Che Guevara commando unit of the Popular Front for the Liberation of Palestine. Through the ensuing media bombardment, she put the Palestinian nation on the global map. The pretty 24-year-old Leila became a hero to many Palestinians, including the Swedish/Palestinian teenager Lina Makboul, who is now a filmmaker. At least Leila dared to do something, Lina thought at the time. She visits Leila 35 years later with a camera, and finds a woman who does not regret anything. Written by Anonymous", "Inspired by the 2006 Academy Award® nominee for Best Foreign Language film, \"Water,\" this documentary tells the story of some of the 20 million Indian widows who are abandoned by their families and literally turned out into the streets when their husbands died. \"Water\" was a fictional recounting of this terrible tradition, set in 1938. \"The Forgotten Woman\" is true, and happening today. Written by Anonymous", "A powerful documentary about five women whose lives have been irrevocably altered by the Rwandan genocide. With the country left nearly 70% female in the wake of the massacres, \"God Sleeps In Rwanda\" is a lucid portrait of the much larger change affected by women in the East African country. Written by akaij", "Documentary which unveils the reality of rape, other forms of sexual violence, and healing in African American communities.", "\"Showing the vulva scares off bears and lions, makes wheat grow higher, calms storm tides and demons fear it. The devil runs away. Showing the vulva can save the world. The vulva is omnipotent.\" This powerful image of the female genitals is unfortunately not anchored in our imagination. While nudity seems no longer taboo, the presentation of the female genitals continues to irritate and various bans have been imposed on it. Decades of retouching in the media, anti-pornography campaigns and aniconistic bans have lead to a public image of the vulva that is far from reality. A \"concept of ideal beauty that is invisibility\" prevails. The film begins in a dermatological surgery in Cologne. Bella Joy has her labia plumped up with hyaluronan and is very pleased with the result... Directors Ulrike Zimmermann and Claudia Richarz present their comprehensive and non-sensationalistic research into the history of the female anatomy from the 16th to the 21st century - from the risqué and at times ... Written by Ulrike Zimmermann", "This feature documentary takes the audience on a disturbing journey deep into a culture that few can comprehend -- that of suicide bombers. Filmmaker Pierre Rehov examines the phenomenon of suicide bombers through rare and never-before-seen interviews with actual family members of terrorists, the prisoners whose bombing attempts have been thwarted, and exclusive footage of a terror bomber as he prepares for mission! This film provides a message of urgency for increasing our understanding of the psychopathological dynamics of these terrorist bombers. We finally gain insight to how these human bombs \"tick\". Written by Anonymous", "", "The Other Sport (Swedish: Den andra sporten) is a three-part documentary series zooming in on the often harsh conditions of women's football/soccer in Sweden since the first clubs got structurally organized in the mid-1960's up until this very day. The three various approaches to story are told from the perspective of today's reality - The Winning Call (Vinnarskallar) - from yesterday's reality - Women Against The Tide (Kärringar mot strömmen) - as well as through a somewhat chronological study and insight to the important dates and decisive situations occurring throughout the history showing the developments of the sport - in Play Seriously (Leken Som Blev Allvar.) Written by ML.", "Mixing non-fiction and fiction, Unlimited Girls follows Fearless explorations and conversations: wondering why women must always lead double lives, being feminist but not saying they are. If feminism changes the way we live, then do we change the meaning of feminism as we live it? Fearless returns to the feminist chat-room peopled by talkative feminist ladies who become her friend, to probe and argue and ask and constantly question what she sees and feels. In the end does she lose or confirm her ambivalence? Does she decide to own the label \"Feminist\" or does she decide it is irrelevant in these post-modern times? Written by Anonymous", "", "Famous actresses talk about their role in the movie industry, and the demand to \"be beautiful and shut up\".", "Documentary presenting the realities of coming out in lesser developed countries.", "At Rock 'n' Roll Camp, girls ranging in age from eight to 18 are taught that it's OK to sweat like a pig, scream like a banshee, wail on their instruments with complete and utter abandon, and that \"it is 100% okay to be exactly who you are.\" The girls have a week to select a band, an instrument they may have never played before, and write a song. In between, they are taught by indie rock chicks such as Carrie Brownstein from Sleater-Kinney various lessons of empowerment from self-defense to anger management. At the end of the week, all the bands perform a concert for over 700 people. The film follows several campers: Laura, a Korean adoptee obsessed by death metal; Misty, who is emerging from a life of meth addiction, homelessness and gang activity; and Amelia, an eight-year-old who writes experimental rock songs about her dog Pipi. The girls are given a temporary reprieve from being sexualized, analyzed and pressured to conform. Written by Anonymous", "'Girls on Top' is an exclusive behind-the-scenes look at the lives of eight women as they reunite to perform in an award-winning production of Caryl Churchill's 'Top Girls'. A funny and insightful examination of what it means to be a 'top girl', 'Girls on Top' features screen and stage icons including Ann-Marie MacDonald and Megan Follows. Written by Anonymous", "", "Documenting for the first time the prestigious women field officers School, Filmmaker Yael Katzir, herself a former officer, is following for five month's five of the fifty women cadets in training. They cope with pressures, challenges and fears. They discover their limits and needs for friendships as they tough it out to the finish line. It is a story about young women aged 18, during compulsory military service in Israel. Written by Anonymous", "Extreme close-ups of 38 vulvas, aged three months to fifty-six years, including two blacks, one half-oriental girl, two lesbians, one prostitute, two adult virgins, three mothers to be, three grandmothers, four women menstruating, one girl with gonorrhea (learned just days after the shoot), a woman who learned she had uterine cancer three weeks after the shoot, and a lot of mothers. Intended as an educational film by and for women, but screened to mixed audiences, the women photographed were mostly friends and acquaintances, or children of friends and acquaintances, of the director. The Glide Methodist Church's education division, which specialized in community service related to sexuality and pregnancy, produced the film, despite the director's male colleagues finding the concept unsavory. Written by Anonymous", "13 GENDERS is an intimate and personal documentary. The interviewees attempt to articulate their interactions with and attitudes toward their own gender expression, intersex and transgender issues, gender in entertainment and the workplace, sexual preference and the future of gender. The non-expert interviews, woven together with music and movie clips, are sometimes funny, often contradictory and occasionally surprisingly similar. Written by Cyra K. Polizzi", "A Documentary about violence, horror, censorship and legislation on the web. In 2009, Remy Couture, a special effects makeup artists from Quebec was arrested by the police right in front of his home and would be later charged with obscenity and corruption of morality. Montreal's police was responding to a complaint regarding pictures coming from his website Inner depravity.com which had been freely circulating on the Web. ART/CRIME discusses violence, fiction and censorship in movies but also in the loosely regulated environment that the Web still represents. The documentary allows many, like movie director Nacho Cerda, Robert Morin and Patrick Senechal to present their thoughts on the matter. Written by Anonymous", "", "Emulating goddess mythology and iconic paintings of reclining female nudes, 8 nude women reflect on a world without men, the human body and psyche, evolution and science.", "Focuses on the socialization of American females. It tells the story of six women and girls. The first film to emerge from the modern women's movement in the early 1970s.", "This documentary tells the tale of Buenos Aires lesbians, focusing on three personal stories. A former militant woman who now devotes her time to feminine soccer; a young woman who is active so no girl has to go through what she went through and a lesbian mother who recounts how hostile the laws are regarding the rights of lesbian women. In spite of the difficulties their characters go through, the stories have a lot of humour, some soccer and a tour of the city. Written by Santiago García"], "Environmental Issues": ["Filmed over nearly five years in twenty-five countries on five continents, and shot on seventy-millimetre film, Samsara transports us to the varied worlds of sacred grounds, disaster zones, industrial complexes, and natural wonders.", "The current method of raw food production is largely a response to the growth of the fast food industry since the 1950s. The production of food overall has more drastically changed since that time than the several thousand years prior. Controlled primarily by a handful of multinational corporations, the global food production business - with an emphasis on the business - has as its unwritten goals production of large quantities of food at low direct inputs (most often subsidized) resulting in enormous profits, which in turn results in greater control of the global supply of food sources within these few companies. Health and safety (of the food itself, of the animals produced themselves, of the workers on the assembly lines, and of the consumers actually eating the food) are often overlooked by the companies, and are often overlooked by government in an effort to provide cheap food regardless of these negative consequences. Many of the changes are based on advancements in science and ... Written by Huggo", "Without words, cameras show us the world, with an emphasis not on \"where,\" but on \"what's there.\" It begins with morning, natural landscapes and people at prayer: volcanoes, water falls, veldts, and forests; several hundred monks do a monkey chant. Indigenous peoples apply body paint; whole villages dance. The film moves to destruction of nature via logging, blasting, and strip mining. Images of poverty, rapid urban life, and factories give way to war, concentration camps, and mass graves. Ancient ruins come into view, and then a sacred river where pilgrims bathe and funeral pyres burn. Prayer and nature return. A monk rings a huge bell; stars wheel across the sky. Written by <jhailey@hotmail.com>", "\"WHAT THE #$*! DO WE KNOW?!\" is a radical departure from convention. It demands a freedom of view and greatness of thought so far unknown, indeed, not even dreamed of since Copernicus. It's a documentary. It's a story. It's mind-blowing special effects. This film plunges you into a world where quantum uncertainty is demonstrated - where neurological processes, and perceptual shifts are engaged and lived by its protagonist - where everything is alive, and reality is changed by every thought. Written by Anonymous", "Koyaanisqatsi is a documentary (of sorts). It is also a visual concert of images set to the haunting music of 'Phillip Glass'. While there is no plot in the traditional sense, there is a definate scenario. The film opens on ancient native American cave drawings, while the soundtrack chants \"Koyaanisqatsi\" which is a Hopi indian term for \"life out of balance\". The film uses extensive time lapse photography (which speeds images up) and slow motion photography to make comparisons between different types of physical motion. In one of the first examples, we see cloud formations moving (sped up) intercut with a montage of ocean waves (slowed down) and in such a way we are able to see the similarities of movement between these natural forces. This technique of comparison exists throughout the film, and through it we learn more about the world around us. The film progresses from purely natural environments to nature as affected by man, and finally to man's own manmade environment, devoid of ... Written by Andrew M. Somers <film@myndex.com>", "A look at the state of the global environment including visionary and practical solutions for restoring the planet's ecosystems.", "Director Davis Guggenheim eloquently weaves the science of global warming with Mr. Gore's personal history and lifelong commitment to reversing the effects of global climate change.  A longtime advocate for the environment, Gore presents a wide array of facts and information in a thoughtful and compelling way.  \"Al Gore strips his presentations of politics, laying out the facts for the audience to draw their own conclusions in a charming, funny and engaging style, and by the end has everyone on the edge of their seats, gripped by his haunting message,\" said Guggenheim.  An Inconvenient Truth is not a story of despair but rather a rallying cry to protect the one earth we all share.  \"It is now clear that we face a deepening global climate crisis that requires us to act boldly, quickly, and wisely,\" said Gore. Written by Plantation Productions", "Atmospheric soundtrack follows this compilation of nature footage that focuses on the Atlantic ocean and various life forms that live, mate and die in it.", "Feature-length version of the documentary TV series Planet Earth (2006), following the migration paths of four animal families.", "A feature length documentary work which presents a case for a needed transition out of the current socioeconomic monetary paradigm which governs the entire world society. This subject matter will transcend the issues of cultural relativism and traditional ideology and move to relate the core, empirical \"life ground\" attributes of human and social survival, extrapolating those immutable natural laws into a new sustainable social paradigm called a \"Resource-Based Economy\". Written by ArchGunner", "The Spirit Molecule investigates dimethyltryptamine (DMT), an endogenous psychoactive compound, which exists in humans and numerous species of plants and animals. The documentary traces Dr. Rick Strassman's government-sanctioned, human DMT research and its many trials, tribulations, and inconceivable realizations. A closer examination of DMT's effects through the lens of two traditionally opposed concepts, science and spirituality, The Spirit Molecule explores the connections between cutting-edge neuroscience, quantum physics, and human spirituality. Strassman's research, and the experiences of the human test subjects before, during, and after the intense clinical trials, raises many intriguing questions. A variety of experts voice their unique thoughts and experiences with DMT within their respective fields. As Strassman's story unfolds, the contributors weigh in on his remarkable theories, including the synthesis of DMT in our brain's pineal gland, its link to near-death & ... Written by Mitch Schultz", "Follow the Manhattan-based Beavan family as they abandon their high consumption 5th Avenue lifestyle and try to live a year while making no net environmental impact.", "With aerial footage from fifty-four countries, 'Home' is a depiction of how Earth's problems are all interlinked.", "A documentary of insect life in meadows and ponds, using incredible close-ups, slow motion, and time-lapse photography. It includes bees collecting nectar, ladybugs eating mites, snails mating, spiders wrapping their catch, a scarab beetle relentlessly pushing its ball of dung uphill, endless lines of caterpillars, an underwater spider creating an air bubble to live in, and a mosquito hatching. Written by Will Gilbert", "An exploration of technologically developing nations and the effect the transition to Western-style modernization has had on them.", "This film shows the disaster of the Kuwaitian oil fields in flames. In contrast to the common documentary film there are no comments and few interviews. What must have been the hell itself is presented to the viewer in such beautiful sights and beautiful music that one has to be fascinated by it. The German title translates 'lessons in darkness'. Written by Oliver Heidelbach", "Two narratives -- the life cycle of a mother walrus and her calf, and the life of a polar bear and her cubs -- are used to illustrate the harsh realities of existence in the Arctic.", "The Crisis Civilization is a documentary feature film investigating how global crises like ecological disaster, financial meltdown, dwindling oil reserves, terrorism and food shortages are converging symptoms of a single, failed global system. Proving that 'another world' is not merely possible, but on its way. Written by Anonymous", "David Attenborough investigates the latest scientific research to discover whether or not there is a global environmental crisis, and, if so, what solutions there are to it.", "A documentary about the development around Barton Springs in Austin, Texas, and nature's unexpected response to being threatened by human interference.", "A look at man's relationship with Dirt. Dirt and humans couldn't be closer. We started our journey together as stardust, swirled by cosmic forces into our galaxy, solar system, and planet. We are made of the same stuff. Four billion years of evolution created dirt as the living source of all life on Earth including humans. Dirt has given us food, shelter, fuel, medicine, ceramics, flowers, cosmetics and color --everything needed for our survival. For most of the last ten thousand years we humans understood our intimate bond with dirt and the rest of nature. We took care of the soils that took care of us. But, over time, we lost that connection. Our species became greedy and careless. We still depend on dirt, but now we abuse and ignore it. We are destroying our last natural resource with our agriculture, our mining, and our paving over the planet for cities. We turned dirt into something \"dirty.\" In doing so, we transform the skin of the earth into a hellish and dangerous landscape ... Written by Anonymous", "Follows the account of Lucy, who is born into a society where people are desperate for natural resources, while the global temperature and population are highly increasing.", "Director Josh Tickell takes us along for his 11 year journey around the world to find solutions to America's addiction to oil. A shrinking economy, a failing auto industry, rampant unemployment, an out-of-control national debt, and an insatiable demand for energy weigh heavily on all of us. Fuel shows us the way out of the mess we're in by explaining how to replace every drop of oil we now use, while creating green jobs and keeping our money here at home. The film never dwells on the negative, but instead shows us the easy solutions already within our reach. Written by Rebecca Harrell", "The Mississippi River Flood of 1927 was the most destructive river flood in American history. In the spring of 1927, the river broke out of its banks in 145 places and inundated 27,000 square miles to a depth of up to 30 feet. Part of it enduring legacy was the mass exodus of displaced sharecroppers. Musically, the Great Migration of rural southern blacks to Northern cities saw the Delta Blues electrified and reinterpreted as the Chicago Blues, Rhythm and Blues, and Rock and Roll. Using minimal text and no spoken dialog, filmmaker Bill Morrison and composer - guitarist Bill Frisell have created a powerful portrait of a seminal moment in American history through a collection of silent images matched to a searing original soundtrack. Written by Anonymous", "A documentary that takes an alternative approach to dealing with the global warming crisis.", "\"We've worked so hard on this land,\" says Sav Samourn. \"And now they've come to destroy it all. Sooner or later it will all be gone.\" In her directorial debut, award-winning filmmaker Kalyanee Mam travels to her native homeland to capture the stories of three young Cambodians struggling to maintain their traditional way of life while the modern world closes in around them. Deep in the jungle, Sav Samourn struggles as large companies encroach and \"progress\" claims the life-giving forests. She discovers there's little room for wild animals, ghosts - and the home she has always known. In a fishing hamlet, Sari Math must quit school to help support his family. But as the fish catch dwindles, Sari and his family find their livelihood threatened. In a village, Khieu Mok must leave to seek work in a Phnom Penh factory to help pay her family's debts. But city life proves no better, and Khieu struggles between her need to send money home and her duty to be with her loved ones. From Cambodia's ... Written by Kalyanee Mam", "A feature-length documentary about our complex relationship with manufactured objects and, by extension, the people who design them.", "Humanity's ascent is often measured by the speed of progress. But what if progress is actually spiraling us downwards, towards collapse? Ronald Wright, whose best-seller, A Short History Of Progress inspired SURVIVING PROGRESS, shows how past civilizations were destroyed by \"progress traps\" - alluring technologies and belief systems that serve immediate needs, but ransom the future. As pressure on the world's resources accelerates and financial elites bankrupt nations, can our globally-entwined civilization escape a final, catastrophic progress trap? With potent images and illuminating insights from thinkers who have probed our genes, our brains, and our social behaviour, this requiem to progress-as-usual also poses a challenge: to prove that making apes smarter isn't an evolutionary dead-end. Written by Producers", "The larger scope of the story explores the gun trade to Africa that takes place under the covers -- Russian pilots fly guns into Africa, then fly fish back out to Europe. The hazards and consequences of this trade are explored, including the pan-African violence propagated by constant flow of weapons into the continent. If it is a \"survival of the fittest\" world, as Darwin concluded, then the capitalist interests that fund the gun runners are climbing the evolutionary ladder on the backs of the Africans in this stark Darwinian example. Much like the foreseeable extinction of the Lake Victoria perch, and death of Lake Victoria itself, the Africans are in grave jeopardy, even as they survive in the only ways they know how. Written by Erin Willis <erindive@yahoo.com>", "Drawing from ancient knowledge and cutting edge science, Symphony of the Soil is an artistic exploration of the miraculous substance soil. By understanding the elaborate relationships and mutuality between soil, water, the atmosphere, plants and animals, we come to appreciate the complex and dynamic nature of this precious resource. The film also examines our human relationship with soil, the use and misuse of soil in agriculture, deforestation and development, and the latest scientific research on soil's key role in ameliorating the most challenging environmental issues of our time. Filmed on four continents, featuring esteemed scientists and working farmers and ranchers, Symphony of the Soil is an intriguing presentation that highlights possibilities of healthy soil creating healthy plants creating healthy humans living on a healthy planet. Written by Anonymous", "Everything you've ever been told about Global Warming is probably untrue. This film blows the whistle on the biggest swindle in modern history. We are told that 'Man Made Global Warming' is the biggest ever threat to mankind. There is no room for scientific doubt. Well, watch this film and make up your own mind. Written by KickAssDude", "It is the largest movement the world has ever seen, it may also be the most important - in terms of what's at stake. Yet it's not east being green. Environmentalists have been reviled as much as revered, for being killjoys and Cassandras. Every battle begins as a lost cause and even the victories have to be fought for again and again. Still, environmentalism is one of the great social innovations of the twentieth century, and one of the keys to the twenty-first. It has arisen at a key juncture in history, when humans have come to rival nature as a power determining the fate of the earth. Written by Anonymous", "THE CITY DARK is a feature documentary about the loss of night. After moving to NYC from rural Maine, filmmaker Ian Cheney asks a simple question - do we need the stars? - taking him from Brooklyn to Mauna Kea, Paris, and beyond. Exploring the threat of killer asteroids in Hawaii, tracking hatching turtles along the Florida coast, and rescuing injured birds on Chicago streets, Cheney unravels the myriad implications of a globe glittering with lights - including increased breast cancer rates from exposure to light at night, and a generation of kids without a glimpse of the universe above. Featuring stunning astrophotography and a cast of eclectic scientists, THE CITY DARK is the definitive story of light pollution and the disappearing stars. Written by Wicked Delicate Films", "This feature-length documentary exposes the public health dangers of genetically modified foods and features leading scientists, physicians, professors, attorneys and activists. You'll see the deep corruption surrounding GMOs and the nefarious deception being perpetrated against the world. Written by Gary Null & Associates", "The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America.", "Jennifer Baichwal's cameras follow Edward Burtynsky (1955- ) as he visits what he calls manufactured landscapes: slag heaps, e-waste dumps, huge factories in the Fujian and Zhejiang provinces of China, and a place in Bangladesh where ships are taken apart for recycling. In China, workers gather outside the factory, exhorted by their team leader to produce more and make fewer errors. A woman assembles a circuit breaker, and women and children are seen picking through debris or playing in it. Burtynsky concludes with a visit to Shanghai, the world's fastest growing city, where wealth and poverty, high-rises and old neighborhoods are side by side. Written by <jhailey@hotmail.com>", "Blind Spot is a documentary film that illustrates the current oil and energy crisis that our world is facing. Whatever measures of ignorance, greed, wishful thinking, we have put ourselves at a crossroad, which offers two paths with dire consequences. If we continue to burn fossil fuels we will choke the life out of the planet and if we don't our way of life will collapse. Written by Adolfo Doring", "PLANEAT is the story of three men's life-long search for a diet, which is good for our health, good for the environment and good for the future of the planet. With an additional cast of pioneering chefs and some of the best cooking you have ever seen, the scientists and doctors in the film present a convincing case for the West to re-examine its love affair with meat and dairy. The film features the ground-breaking work of Dr. T Colin Campbell in China exploring the link between diet and disease, Dr. Caldwell Esselstyn's use of diet to treat heart disease patients, and Professor Gidon Eshel's investigations into how our food choices impact our land, oceans and atmosphere. With the help of some innovative farmers and chefs, PLANEAT shows how the problems we face today can be solved, without simply resorting to a diet of lentils and lettuce leaves. Written by PLANEAT", "A well-known nightmarish vision of the future: The Earth's population reaches seven billion. Dwindling resources, mountains of toxic waste, hunger and climate change-the results of overpopulation? Who says that the world's overpopulated? And who's one too many? After the box-office success of \"Plastic Planet,\" in POPULATION BOOM curious documentary filmmaker Werner Boote travels the globe and examines a stubborn view of the world that has existed for decades. But he sees a completely different question: Who or what is driving this catastrophic vision? Written by NGF", "Whaledreamers is the heartfelt story of the return of an aboriginal whale dreaming tribe from the edge of extinction and the equally, long journey of the whales, not only to survive the slaughter by man, but to engage the human race into waking up in time. Written by Anonymous", "5 years in the making, Minds In The Water is the story of one surfer's international journey to help protect dolphins, whales and their ocean environment. Shot on location in Australia, the Galapagos, Chile and Japan, the film captures a key moment in one person's life when apathy is no longer an option. Pro surfer Dave Rastovich went from observer to activist when he embarked on a personal mission to help stop the worldwide commercial slaughter of dolphins and whales. While unsure at first, Rasta quickly found his activist sea legs and helped build a core team of filmmakers, journalists, musicians, eco-pirates and celebrity surfers to help spread the message. All this has been documented in the film, Minds In The Water. Written by Anonymous", "A journey, reaching to the past to understand the origins of the catastrophic environmental transitions we now face. Over two years, director Matt Anderson traveled 16,000 miles to document firsthand our modern industrial world and the environmental destruction in its wake. In the process, he discovered exciting strategies to help humanity transcend the coming ecological and psychological crisis. Some of today's most progressive thinkers, from anthropologists and bio-architects to psychologists and journalists collectively recreate a story of humanity and the history of Earth, illuminating a desperately needed new path for us to take. Fall and Winter is a survival guide for the 21st Century. Written by Fall and Winter", "Vivaldi's The Four Seasons and four outstanding violinists are the threads the filmmakers use to weave this exploration of how nature shapes who we are. As Spring reaches Toyko and the cherry blossoms burst to life, violinist Sayaka Shoji demonstrates to her young students the timeless lessons in the music, and in their own culture. Niki Vasilakis and friends travel from all corners of Australia to the Far North to share the music of Summer with the Thursday Island Community, as the monsoon clouds gather. As the leaves turn, Cho-Liang (Jimmy) Lin and his neighbours reveal to us their New York City's vibrant, complex personality. Finally, in the icy reaches of Finnish Lapland, Pekka Kuusisto and his colleagues bring the warmth of music and human interaction to the small local community. A documentary full of fascinating characters, fine music and glorious images as it reflects on the global experience of the seasons. Written by Anonymous", "The Oil Barons, Wildcatters, and roughnecks and their long struggle to feed America's ferocious oil appetite. Step inside the oil culture to understand just how the USA became so addicted and why Houston believes we must go \"Green\" for a secure domestic energy future. Written by Anonymous", "Seen through the eyes of activist, farmers and journalists, Waking the Green Tiger follows an extraordinary campaign to stop a huge dam project on the Upper Yangtze river in southwestern China. Featuring astonishing archival footage never seen outside China, and interviews with a government insider and witnesses, the documentary also tell the history of Chairman Mao's campaigns to conquer nature in the name of progress. An environmental movement takes root when a new environmental law is passed, and for the first time in China's history, ordinary citizens have the democratic right to speak out and take part in government decisions. Activist test this new freedom and save a river. The movement they trigger has the potential to transform China. Written by Anonymous", "Daily Planet, Discovery Channel's flagship science magazine, explores the latest science behind the headlines and the coolest scientific developments that impact our lives in every way. It features daily news, discussions and commentary on the scientific aspects of current events and discoveries. The show airs weekday nights on Discovery Channel Canada. Written by randy@att.net", "From peyote to prozac, a sensitive portrait of five former hippies now approaching middle age.", "Wind power... It's green... It's good... It reduces our dependency on foreign oil... That's what the people of Meredith, in upstate New York first thought when a wind developer looked to supplement this farm town's failing economy with a farm of their own -- that of 40 industrial wind turbines. Attracted at first to the financial incentives, residents grow increasingly alarmed as they discover side effects they never dreamed of, as well as the potential for disturbing financial scams. With wind development growing rapidly at 39% annually in the US, WINDFALL is an eye-opener for anyone concerned about the future of renewable energy. Written by Anonymous", "YERT (Your Environmental Road Trip) is an adventure and a celebration of the American spirit in the face of adversity - a thought-provoking, inspiring, and sometimes hilarious, documentary about the courageous and creative individuals, groups, businesses and leaders of this country who are tackling the greatest environmental threats in history. Called into action by the ever increasing threats of planetary catastrophe (from climate change to toxic pollution, from water scarcity to habitat destruction), the three of us - Mark Dixon, Ben Evans, and Julie Dingman Evans - upended our lives, pooled our collective life-savings, and set off on a first-of-its-kind, 50-state, year-long journey of discovery to personalize sustainability and to answer a critical question: Are we doomed? Written by Anonymous", "A documentary that systematically challenges the common human belief that humans are superior to other life forms. The documentary reveals the absurdity of this belief while exploding human bias. Written by Anonymous"], "LBGT Rights": ["A documentary portrait of the late John Wojtowicz, whose attempted robbery of a Brooklyn bank to finance his male lover's sex-reassignment surgery was the real-life inspiration for Dog Day Afternoon (1975).", "BRIDEGROOM tells the emotional journey of Shane and Tom, two young men in a loving and committed relationship - a relationship that was cut tragically short by a misstep off the side of a roof. The story of what happened after this accidental death - of how people without the legal protections of marriage can find themselves completely shut out and ostracized - is poignant, enraging and opens a window onto the issue of marriage equality like no speech or lecture ever will. On May 7, 2012, the anniversary of Tom's death, after a year of documenting his own grief, Shane decided to make a video tribute to his partner entitled \"It Could Happen To You.\" This film, posted on YouTube, received over 3.2 million hits and inspired over 50 thousand e-mails and comments on YouTube and Facebook. The impact of Shane's original film and the raw nerve it touched, tells us this is an important story that needs to be brought to the world stage. Written by Anonymous", "From the rain of Japan, through threats of arrest for 'public indecency' in Canada, and a birthday tribute to her father in Detroit, this documentary follows Madonna on her 1990 'Blond Ambition' concert tour. Filmed in black and white, with the concert pieces in glittering MTV color, it is an intimate look at the work of the music performer, from a prayer circle with the dancers before each performance to bed games with the dance troupe afterwards. Written by Bruce Cameron <dumarest@midcoast.com>", "This is a documentary of 'drag nights' among New York's underclass. Queens are interviewed and observed preparing for and competing in many 'balls'. The people, the clothes, and the whole environment are outlandish. Written by Robbie Smith <robsmith@u.washington.edu>", "In the early years of the AIDS epidemic, the disease was considered a death sentence affecting communities, like the LGBT ones, whom many in power felt deserved it. This film tells the story of how militant activists like ACT-UP and TAG pushed for a meaningful response to this serious public health problem. As the activists struggled against political indifference, religious hostility, corporate greed and apparently skewed scientific research priorities with determination and sheer audacity, they produced a political wave that would lead to not only an effective treatment regime, but would advance LGBT rights beyond anyone's expectations. Written by Kenneth Chisholm (kchishol@rogers.com)", "Men, most of them naked, talk about their penises. The men range from 17 to 70+, all are from the U.S. of diverse races. Several are artists or performers. Some are gay, others straight; two are transsexual. One is paralyzed below the chest. The interviews are edited around themes: discovery, early sexual experiences, masturbation, size, oral sex, libido, performance, disease and maladies, maturity. A lexicographer discusses language, especially slang; a few archival educational-film clips divide the topics. Images and stories mix with facts and philosophical reflection. The usually private becomes public. Written by <jhailey@hotmail.com>", "This documentary follows one year in the life of Joan Rivers, who sees herself first and foremost as an actress, with her life as a comedienne/writer just an extension of being an actress. Now at age 75, Rivers has faced her ups and downs in her forty plus year career, the year leading up to filming being a down compared to what she would have wanted, which is a calendar full of engagements with several engagements each day. That want is in part to support her opulent personal lifestyle, but is more a need to bolster her own sense of self-worth as a basically insecure person who is probably best known now for her overuse of cosmetic surgery rather than her professional work. She feels that Kathy Griffin, who she admires, is now getting all the engagements she would have gotten in her prime. During this year, Rivers is seen going from engagement to engagement, some big - such as a Kennedy Center Honors for George Carlin, a double bill with Don Rickles in New York, and her own celebrity... Written by Huggo", "A look at the mundane goings on behind the scenes at the making of a male porn film.", "In the early 1900's, a new invention (and one of the very first uses of the electric motor) was created to address the 'problem' of women's hysteria. These devices immediately became an essential household appliance, and were advertised in nearly every women's magazine and sewing notions catalog of the time. 70 Years later, these appliances were condemned as 'perverted sex toys,' and became the subject of heated debate among lawmakers. In California, Texas, and several other states, conservative politicians successfully waged legislative campaigns to outlaw and prohibit the sale, ownership or use of vibrators and dildos while simultaneously criminalizing other 'deviant' sexual practices. Although a number of these laws have been overturned by legislatures or the courts, in the State of Texas freedom fighters are still working to eliminate these absurd and unnecessary laws. Dildo Diaries takes a lighthearted but 'probing' approach to exploring the development of sections of the Texas ... Written by IA Films Distribution <distribution@iafilms.com>", "How Divine, aka Harris Glenn Milstead, became John Waters' cinematic muse and an international drag icon.", "Thirteen men and one woman look back at gay life and sex in Manhattan and Fire Island - from Stonewall (June, 1969) to the first reporting on AIDS (June, 1981). They describe the rapid move from repression to celebration, from the removal of shame to joy, the on-going search for \"someone,\" the freedom before AIDS, the friendships, and brotherhood. They take us through cruising and sex in public places, the drug scene, the bars and the baths, the birth of entertainment and dance clubs, and starry nights on Fire Island. Photographs, home movies, newsreels, and film clips illustrate the story. A few contemporary \"what did the 70's mean?\" man-in-the-street takes end the documentary. Written by <jhailey@hotmail.com>", "A behind-the-scenes look inside the case to overturn California's ban on same-sex marriage. Shot over five years, the film follows the unlikely team that took the first federal marriage equality lawsuit to the U.S. Supreme Court.", "We meet five Christian families, each with a gay or lesbian child. Parents talk about their marriages and church-going, their children's childhood and coming out, their reactions, and changes over time. The stories told by these nine parents and four adult children alternate with talking heads - Protestant and Jewish theologians - and with film clips of fundamentalist preachers and pundits and news clips of people in the street. They discuss scripture and biblical scholarship. A thesis of the film is that much of Christianity's homophobia represents a misreading of scripture, a denial of science, and an embrace of quack psychology. The families call for love. Written by <jhailey@hotmail.com>", "TWO: The Story Of Roman and Nyro documents the 12-year journey of legendary songwriter Desmond Child and his lifelong partner Curtis Shaw, and the extraordinary way they met and connected with Angela Whittaker, the woman who would carry their twin sons, Roman and Nyro, into the world. From preconception through the boys' first 10 years, TWO is the personal and powerful story of these unique individuals whose lives become inextricably woven together in magical and unexpected ways. TWO is testament to the universal power and ultimate triumph of love - that it is love that makes a family, affirming modern families may be modern in their making, but timelessly human at their core. Written by Anonymous", "A comprehensive documentary of the history of gays and lesbians in cinema, from negative to positive reflections of gay characters and the troubles of actors and actresses. Written by R. John Berggren <jberg@nina.pagesz.net>", "101 Rent Boys is shot on location in various motel rooms situated on the length of the Santa Monica Boulevard, and features 101 different hustlers. Although the film features 101 different people, it focuses on the lives (and loves) of a few key men. They have been chosen to reflect the immense diversity of the boys of the Santa Monica Strip. An amazing thing happens when you cross a video camera with award-winning directors, $50 and a hustler. The pieces are slickly grouped to cover certain themes; such as their first john, gay for pay, homelessness, drugs or the reason that they began to work as a rent boy. It also explores the variety of insiders' opinion on subjects such as; how a rent boy should dress, speak, act, think, give head, receive head, increase cash flow, keep safe, walk, eat, smoke, and flirt. Written by Strand Releasing <www.strandreleasing.com>", "", "Documentary look at doomed male prostitutes in Prague, ages 15 to 18, who troll at the public swimming pool, the train station, a video arcade, and a disco. After the boys talk about how they got in the game, the camera follows them to the home of Pavel Rousek. Under the name Hans Miller, he makes gay porno videos, primarily for German distribution. Intercut with a movie shoot chez Rousek is an interview that follows him to his day job at a morgue, where he performs an autopsy as he talks about his work. The sex is without protection; the boys are without family. They talk about their bodies and souls, money, their sexual orientation, AIDS, their dreams, and death. Written by <jhailey@hotmail.com>", "\"Les Invisibles\" (The Invisible) of the title are a group men and women born between the two world wars. They have nothing in common except they are all gay and that they decided to be open about their homosexuality at a time when society rejected them. Despite general disapproval, they refused to deny who they actually were, thus maintaining their integrity. Today they talk before Sébastien Lifshitz's camera. Without hate. Without bitterness. With cheerful dignity. Written by Guy Bellinger", "Palm Springs' White Party is the backdrop for this documentary on the fast-paced world of gay circuit parties. Halpern and Rolov follow three young men: 23-year old straight-laced circuit virgin, Brandon; 21-year old party boy with a drug problem, Tone; and sensitive but strong-willed 19-year old, Jon. Accompanying them is Jon's \"soulmate,\" Todd, a 35-year old businessman recklessly reliving his adolescence, plus other \"circuit friends\" the boys make along the way. When Boys Fly pulls no punches in exposing this world - men are shown overdosing and engaging in risky behavior - but at the same time, it also shows the sense of community and vitality the parties bring to the men who attend. Written by Anonymous", "2 Members of the San Francisco Board of Supervisors Harvey Milk & San Francisco Mayor, 'George Moscone (I)' were assassinated by recently resigned Supervisor Dan White on Monday, November 27th, 1978, approximately 8:45 AM to 9:15 AM. Milk's life leading up to his election, his successful efforts to politically represent San Francisco's gay community, and the city's reaction to the assassinations are documented with extensive news film and personal recollections. Written by Ed Stephan <stephan@cc.wwu.edu>", "Through the voices of Americans from all walks of life, OThe OUT List explores the identities of the lesbian... See full synopsis »", "Robert De Niro, Sr., was a celebrated painter obscured by the pop-art movement. His life and career are chronicled in the artist's own words by his contemporaries and, movingly, by his son, the actor Robert De Niro.", "'We Were Here' is the first film to take a deep and reflective look back at the arrival and impact of AIDS in San Francisco, and how the City's inhabitants dealt with that unprecedented calamity. It explores what was not so easy to discern in the midst of it all - the parallel histories of suffering and loss, and of community coalescence and empowerment. Though this is a San Francisco based story, the issues it addresses extend not only beyond San Francisco but also beyond AIDS itself. 'We Were Here' speaks to our societal relationship to death and illness, our capacity as individuals to rise to the occasion, and the importance of community in addressing unimaginable crises. Written by Anonymous", "This was the original \"Real World\". The show was a weekly documentary which followed the real life travails of the Loud family, a mixed up cluster of suburbanites. The show picked up lots of interesting footage, including an on-camera divorce demand from wife Pat to her husband, and the coming-out of one of the children who was gay. Written by Anthony Ventarola <ventman1@bestweb.net>", "In Their Room (2009-present) is an on-going multi-city documentary series about gay men, bedrooms and intimacy. The series veers into the bedrooms of men where you see them doing everything from the most banal to the sometimes more erotic. Complimenting the revealing nature of their everyday activities are confessional interviews about fantasies, turn-ons and vulnerabilities. The throughline of the series highlights the ways in which gay men in disparate cultures deal with connection, intimacy and loneliness in the modern world. In an age of accelerated gay acceptance and visibility, it's shocking that many of these stories are being left undocumented. My inspiration for the series came largely out of such a frustration. If representations of my life -and that of my friends- were largely going unseen in the media I reasoned that I should be recording these stories before they were lost or forgotten. I do this as best I can focusing on what feels authentic, modern and uncensored. The ... Written by In Their Room", "Chronicles Madonna's 2004 Re-Invention World Tour and \"new\" Madonna", "A documentary look, mostly through the eyes of Tammy Faye Bakker Messner, at her rise and fall as a popular televangelist with husband Jim Bakker. Traces their rise: her teen marriage to Jim; their children's TV show (she was a puppeteer and singer), success founding the 700 Club, co-founding the Trinity Broadcast Network, and starting PTL Network; her nondenominational version of Christianity reaching out to all; and, their building of Heritage USA, a theme park. Things fall apart as money woes mount for Heritage and for Jim, as Tammy takes pills, and as Jerry Falwell takes PTL. Jim goes to prison; she remarries, finds herself alone again, yet remains unsinkable. Written by <jhailey@hotmail.com>", "", "", "This inventive marriage of images and interviews profiles portrait artist Austin Young's working relationships with drag superstar Jackie Beat, comedienne Selene Luna, and art curator Lenora Claire; follows actor Christopher Sutton into the mind of renegade filmmaker Bruce La Bruce; examines Nick San Pedro's pop art paintings with Britney Spears impersonator Derrick Barry; and takes a peak inside Adam Bouska's photography studio, home to his silent protest, the NOH8 Campaign. Written by Anonymous", "This 1 hour and 35 minute feature takes you on a day by day journey through the lives of the biggest names in the all-male adult industry from multi-award winning directors, video stars and tireless crew members. Get to know the 39 real men (and 1 woman) who build the world's all-male fantasies... eXposed: The Making of a Legend! \" Written by COLTstudiogroup.com press release (used with permission)", "A personal, accessible look at an artist - Kevin Barnes, frontman of the endlessly versatile indie pop band of Montreal - whose pursuit to make transcendent music at all costs drives him to value art over human relationships. As he struggles with all of those around him, family and bandmates alike, he's forced to reconsider the future of the band, begging the question - is this really worth it? Written by Oscilloscope Laboratories", "THE RUGBY PLAYER is an uplifting and stereotype-shattering documentary that tells the story of a mother, a son, and what it takes to be a hero. The film explores the lives of Mark Bingham, one of the passengers of United Flight 93 on 9/11, and his mother, Alice Hoagland, a former United Airlines flight attendant. THE RUGBY PLAYER is an intimate portrait of how a son's heroism can inspire a nation, and how a mother's love can turn profound loss into unshakable resolve. Utilizing footage shot by Bingham himself, this timely film provides keen insights for the national debates on LGBT rights, marriage equality and gay athletes in sports. Written by imfreeman6", "In Uganda, a new bill threatens to make homosexuality punishable by death. David Kato - Uganda's first openly gay man - and his fellow activists work against the clock to defeat the legislation while combating vicious persecution in their daily lives. But no one, not even the filmmakers, is prepared for the brutal murder that shakes the movement to its core and sends shock waves around the world. Written by Anonymous", "Google Baby is a journey across three continents telling the story of the up and coming baby production industry in the age of globalization. Doron, an Israeli entrepreneur with a high tech background proposes a new service - Baby production. The baby producer (as he introduces himself) provides customers with a cost effective solution using outsourcing of the surrogacy element to India as way to lower prices. The preferred genetic material is selected by the clients and the rest is left in the hands of the producer: Sperm and eggs are purchased on-line and multiple embryos are produced and frozen. Packed in liquid nitrogen only the embryos that fit the customers preferences are shipped by air to India - where they are implanted into the wombs of local surrogates. The customers arrive only at the end of the nine month pregnancy period to pick up their babies. Today, technology has turned 'making a baby' into an act independent of sex. And globalization is making it affordable. Written by Anonymous", "Shortly after the death of Yves Saint Laurent (1936-2008), his lover Pierre Bergé talks to the camera about their life together, moving chronologically from their meeting when 21-year-old Saint Laurent became creative director at Christian Dior upon the founder's death, through twice-annual unveilings of new collections, life in Marrakesh, Saint Laurent's depression and drug use, sobriety, and retirement. The boxing and auctioning of their vast collection of art brings the story to a close. Archival photos and news footage as well as interviews with a few friends give texture to Bergé's account. Written by <jhailey@hotmail.com>", "Malcolm Ingram introduces us to gay men who dig big dudes who are stockier and hairier than the airbrushed ideal served by up lifestyle magazines and underwear ads. From 'bear runs' - the circuit parties of the ursine - to men proudly accepting their own bodies (and the beer bellies the want to cuddle), Bear Nation proves love really does come in all shapes and sizes. Written by Outfest Film Festival", "Southern Comfort documents the final year in the life of Robert Eads, a female-to-male transsexual. Eads, diagnosed with ovarian cancer, was turned down for treatment by two dozen doctors out of fear that treating such a patient would hurt their reputations. By the time Eads received treatment, the cancer was too advanced to save his life. Filmmaker Kate Davis follows Robert and a group of trans-gendered Southerners in this captivating and truly touching documentary. Written by Anonymous", "What or who is Big Joy? Big Joy is James Broughton, pioneer of experimental cinema in the 1940s, and trickster poet who was a precursor to the beat movement in San Francisco. BIG JOY is a documentary that explores the twists and turns in the life of a very colorful character, plus how art has the power to save lives and make the world a better place. Broughton is a role model of living one's life to the fullest, or \"follow your own weird\" as he called it. BIG JOY features interviews with experts, colleagues, friends and lovers, plus images from his films, and the words of many of his kooky poems. Written by Anonymous", "Examines the diversity of human sexual and gender variance around the globe, with commentary by scientific experts and first-hand accounts of people who do not conform to a simple male/female binary.", "In 2009, thousands of LGBT citizens are denied almost 200 civil rights their straight, married counterparts enjoy through civil marriage. Some states have signaled progress. But amid the progress, The Mormon Church, with its front-group THE NATIONAL ORGANIZATION FOR MARRIAGE, has been coordinating, financing and leading the effort to stop the advancement of marriage equality for more than three decades. As an organization worth hundreds of billions of dollars, the Mormon Church has been able to wage this war in secret. Not until the California Fair Political Practices Commission launched an investigation into the Mormon's involvement in Proposition 8, did the secrets of the Mormon effort become a matter of record. Through never-before seen documents, recordings & insider-interviews, 8: THE MORMON PROPOSITION, exposes the efforts of the Mormon Church and its members to halt nearly every piece of LGBT legislation on the desks of lawmakers from Hawaii to New York. 8: THE MORMON ... Written by Steven Greenstreet", "Filmmaker Kimberly Reed returns home for her high school reunion, ready to reintroduce herself to the small town as a transgender woman and hoping for reconciliation with her long estranged adopted brother Marc. Things are complicated by the shocking revelation that Marc may be the grandson of Orson Wells and Rita Hayworth, forcing Kim and her family to explore questions of sexual orientation, identity, severe trauma and love. Written by Anonymous", "Bigger Splash, A", "Members of the controversial group NAMBLA (North American Man/Boy Love Association) discuss why their organization supports \"boys and men who have or desire engagements in sexual or emotional relationships.\" Written by Buckie Chuckie", "n a time, when Islam is under tremendous attack-from within and without-'A Jihadfor Love' is a daring documentary-filmed in twelve countries and nine languages. Muslim gay filmmaker Parvez Sharma has gone where the silence is strongest, filming with great risk in nations where government permission to make this film was not an option. A Jihad for Love is the first-ever feature-length documentary to explore the complex global intersections of Islam and homosexuality. With unprecedented access and depth, Sharma brings to light the hidden lives of gay and lesbian Muslims from countries like Iran, Pakistan, Egypt, Turkey, France, India, and South Africa. The majority of gay and lesbian Muslims must travel a lonely and often dangerous road. In many nations with a Muslim majority, laws based on Quranic interpretations are enforced by authorities to monitor, entrap, imprison, torture and even execute homosexuals. Even for those who migrate to Europe or North America and adopt Western ... Written by Parvez Sharma", "A documentary on the work of sex-change specialist Dr.Leo Wollman, including interviews with Dr.Wollman and a few of his patients, with an illustrated lecture on the various aspects of transsexuality plus actual footage of a sex-change operation, which is what gives the film its notoriety. Written by Michael Brooke <michael@everyman.demon.co.uk>", "The worlds of a former neo-Nazi and the gay victim of his senseless hate crime attack collide by chance 25 years after the incident that dramatically shaped both of their lives. They proceed to embark on a journey of forgiveness that challenges both to grapple with their beliefs and fears, eventually leading to an improbable collaboration...and friendship. Written by Anonymous", "A look at same sex marriage through the eyes of several couples facing dilemmas raised by the uncertain state of American laws in this regard.", "In 1987 San Francisco, Eddie Lee Sausage and Mitch Deprey began recording the squabbles of their stranger than fiction neighbors, the bigoted Raymond Huffman and the out and proud Peter Haskett. The recital of the pair's outrageous reality quickly took on a life of its own. This darkly funny documentary chronicles the history of Raymond and Peter, as well as what happened to former slackers Eddie and Mitch, who paint a picture of not only their outrageous neighbors, but also of San Francisco's Lower Haight neighborhood in the late 1980s. Interviews with others who were influenced by the recordings document their broad influence on a variety of artists, near and far. Written by TrivWhiz"]}